[    0.000000] Linux version 5.18.10-76051810-generic (XXX@XXX) (gcc (Ubuntu 11.2.0-19ubuntu1) 11.2.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #202207071639~1657252310~22.04~7d5e891 SMP PREEMPT_DYNAMIC Fri J
[    0.000000] Command line: initrd=\EFI\Pop_OS-XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX\initrd.img root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX ro quiet loglevel=0 systemd.show_status=false splash
[    0.000000] KERNEL supported cpus:
[    0.000000]   Intel GenuineIntel
[    0.000000]   AMD AuthenticAMD
[    0.000000]   Hygon HygonGenuine
[    0.000000]   Centaur CentaurHauls
[    0.000000]   zhaoxin   Shanghai  
[    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
[    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
[    0.000000] x86/fpu: Enabled xstate features 0x7, context size is 832 bytes, using 'standard' format.
[    0.000000] signal: max sigframe size: 1776
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000009ffff] usable
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x000000009bcb5fff] usable
[    0.000000] BIOS-e820: [mem 0x000000009bcb6000-0x000000009bdd7fff] reserved
[    0.000000] BIOS-e820: [mem 0x000000009bdd8000-0x000000009be16fff] ACPI data

[   16.461796] systemd[1]: Mounted Huge Pages File System.
[   16.462120] systemd[1]: Mounted POSIX Message Queue File System.
[   16.462366] systemd[1]: Mounted Kernel Debug File System.
[   16.462605] systemd[1]: Mounted Kernel Trace File System.
[   16.463334] systemd[1]: Finished Create List of Static Device Nodes.
[   16.463997] systemd[1]: XXX@XXX: Deactivated successfully.
[   16.464508] systemd[1]: Finished Load Kernel Module configfs.
[   16.465104] systemd[1]: XXX@XXX: Deactivated successfully.
[   16.465630] systemd[1]: Finished Load Kernel Module drm.
[   16.466458] systemd[1]: XXX@XXX: Deactivated successfully.
[   16.467024] systemd[1]: Finished Load Kernel Module fuse.
[   16.470463] systemd[1]: Mounting FUSE Control File System...
[   16.472703] systemd[1]: Mounting Kernel Configuration File System...
[   16.475373] systemd[1]: Mounted FUSE Control File System.
[   16.479296] systemd[1]: Mounted Kernel Configuration File System.
[   16.591811] systemd[1]: Started Journal Service.
[   16.595261] EXT4-fs (sda3): re-mounted. Quota mode: none.
[   16.790201] systemd-journald[345]: Received client request to flush runtime journal.
[   16.876258] lp: driver loaded but no devices found
[   16.904673] ppdev: user-space parallel port driver
[   17.121904] IPMI message handler: version 39.2
[   17.131073] ipmi device interface
[   17.366463] io scheduler kyber registered
[   18.531861] ccp 0000:00:08.0: 4 command queues available
[   18.551353] ccp 0000:00:08.0: ccp enabled
[   18.661479] io scheduler bfq registered
[   18.810591] pstore: Using crash dump compression: deflate
[   18.810620] pstore: Registered efi as persistent store backend
[   18.832766] toshiba_bluetooth: Toshiba ACPI Bluetooth device driver
[   19.025635] toshiba_acpi: Toshiba Laptop ACPI Extras version 0.24
[   19.405754] toshiba_acpi: WMI event detected, hotkeys will not be monitored
[   19.474983] toshiba_acpi: Supported laptop features: touchpad special-function-keys panel-power-on cooling-method
[   20.271915] snd_hda_intel 0000:00:01.1: enabling device (0000 -> 0002)
[   20.272315] snd_hda_intel 0000:00:01.1: Force to non-snoop mode
[   20.404736] snd_hda_codec_realtek hdaudioC1D0: autoconfig for ALC233: line_outs=1 (0x14/0x0/0x0/0x0/0x0) type:speaker
[   20.404761] snd_hda_codec_realtek hdaudioC1D0:    speaker_outs=0 (0x0/0x0/0x0/0x0/0x0)
[   20.404770] snd_hda_codec_realtek hdaudioC1D0:    hp_outs=1 (0x21/0x0/0x0/0x0/0x0)
[   20.404779] snd_hda_codec_realtek hdaudioC1D0:    mono: mono_out=0x0
[   20.404785] snd_hda_codec_realtek hdaudioC1D0:    inputs:
[   20.404792] snd_hda_codec_realtek hdaudioC1D0:      Mic=0x19
[   20.404799] snd_hda_codec_realtek hdaudioC1D0:      Internal Mic=0x12
[   20.456001] input: HD-Audio Generic Mic as /devices/pci0000:00/0000:00:14.2/sound/card1/input13
[   20.456223] input: HD-Audio Generic Headphone as /devices/pci0000:00/0000:00:14.2/sound/card1/input14
[   20.504156] input: HDA ATI HDMI HDMI/DP,pcm=3 as /devices/pci0000:00/0000:00:01.1/sound/card0/input15
[   20.776934] mc: Linux media interface: v0.10
[   20.907276] videodev: Linux video capture interface: v2.00
[   21.207505] usb 2-1.2: Found UVC 1.00 device TOSHIBA Web Camera - HD (04f2:b446)
[   21.228276] input: TOSHIBA Web Camera - HD: TOSHIB as /devices/pci0000:00/0000:00:13.0/usb2/2-1/2-1.2/2-1.2:1.0/input/input16
[   21.228656] usbcore: registered new interface driver uvcvideo
[   22.512205] cfg80211: Loading compiled-in X.509 certificates for regulatory database
[   22.512790] cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
[   24.037649] SVM: TSC scaling supported
[   24.037658] kvm: Nested Virtualization enabled
[   24.037660] SVM: kvm: Nested Paging enabled
[   24.037667] SVM: LBR virtualization supported
[   25.595628] Adding 4193784k swap on /dev/mapper/XXXXXXXXXX  Priority:-2 extents:1 across:4193784k FS
[   25.818201] MCE: In-kernel MCE decoding enabled.
[   25.888702] Bluetooth: Core ver 2.22
[   25.888794] NET: Registered PF_BLUETOOTH protocol family
[   25.888797] Bluetooth: HCI device and connection manager initialized
[   25.888806] Bluetooth: HCI socket layer initialized
[   25.888811] Bluetooth: L2CAP socket layer initialized
[   25.888820] Bluetooth: SCO socket layer initialized
[   26.015530] usbcore: registered new interface driver btusb
[   36.241157] RTL8208 Fast Ethernet r8169-0-200:00: attached PHY driver (mii_bus:phy_addr=r8169-0-200:00, irq=MAC)
[   36.499172] r8169 0000:02:00.0 enp2s0: Link is Down
[   37.414208] Dynamic Preempt: full
[   37.538145] Dynamic Preempt: full
[   38.448072] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[   38.448088] Bluetooth: BNEP filters: protocol multicast
[   38.448103] Bluetooth: BNEP socket layer initialized
[   38.480847] NET: Registered PF_ALG protocol family
[   38.732837] rtl8723be 0000:01:00.0: enabling device (0000 -> 0003)
[   38.749253] rtl8723be: Using firmware rtlwifi/rtl8723befw_36.bin
[   38.761622] ieee80211 phy0: Selected rate control algorithm 'rtl_rc'
[   38.765063] rtlwifi: rtlwifi: wireless switch is on
[   38.825033] rtl8723be 0000:01:00.0 wlp1s0: renamed from wlan0
[   44.355704] wlp1s0: authenticate with XXX
[   44.355747] wlp1s0: bad VHT capabilities, disabling VHT
[   44.355752] wlp1s0: 80 MHz not supported, disabling VHT
[   44.814190] wlp1s0: send auth to XXX (try 1/3)
[   44.817305] wlp1s0: authenticated
[   44.817861] wlp1s0: associate with XXX (try 1/3)
[   44.827491] wlp1s0: RX AssocResp from XXX (capab=0x1411 status=0 aid=1)
[   44.827730] wlp1s0: associated
[   45.534181] wlp1s0: Limiting TX power to 30 (30 - 0) dBm as advertised by XXX
[   45.562381] IPv6: ADDRCONF(NETDEV_CHANGE): wlp1s0: link becomes ready
[   66.213828] rfkill: input handler disabled
[   75.950458] Bluetooth: RFCOMM TTY layer initialized
[   75.950489] Bluetooth: RFCOMM socket layer initialized
[   75.950511] Bluetooth: RFCOMM ver 1.11
[ 2383.016010] rfkill: input handler enabled
[ 2395.157121] rfkill: input handler disabled
[ 2851.461385] BPF: 	 type_id=197 bits_offset=64
[ 2851.461398] BPF:  
[ 2851.461402] BPF: Invalid name
[ 2851.461405] BPF: 
[ 2851.461410] failed to validate module [binfmt_misc] BTF: -22
[ 2855.572077] BPF: 	 type_id=197 bits_offset=64
[ 2855.572091] BPF:  
[ 2855.572094] BPF: Invalid name
[ 2855.572097] BPF: 
[ 2855.572101] failed to validate module [binfmt_misc] BTF: -22
[ 2857.038140] BPF: 	 type_id=197 bits_offset=64
[ 2857.038155] BPF:  
[ 2857.038158] BPF: Invalid name
[ 2857.038161] BPF: 
[ 2857.038165] failed to validate module [cpuid] BTF: -22
[ 2859.900456] BPF: 	 type_id=197 bits_offset=64
[ 2859.900469] BPF:  
[ 2859.900472] BPF: Invalid name
[ 2859.900475] BPF: 
[ 2859.900480] failed to validate module [binfmt_misc] BTF: -22
[ 2884.745837] BPF: 	 type_id=197 bits_offset=64
[ 2884.745851] BPF:  
[ 2884.745854] BPF: Invalid name
[ 2884.745857] BPF: 
[ 2884.745862] failed to validate module [binfmt_misc] BTF: -22
[ 3303.932167] io.elementary.a[2320]: segfault at 8 ip 0000564a5761fa41 sp 00007ffde87ec2a0 error 4 in io.elementary.appcenter (deleted)[564a575e9000+67000]
[ 3303.932197] Code: ca fc ff 48 89 e9 48 89 ef 48 8d 15 99 97 ff ff 45 31 c0 48 8d 35 8a 0e 03 00 e8 4a fa fc ff 48 8b 45 50 48 89 ef 48 8b 40 08 <48> 8b 70 08 e8 66 f9 fc ff 48 83 c4 08 4c 89 e0 5d 41 5c 41 5d 41
[ 6797.511108] Dynamic Preempt: voluntary
[ 7201.125849] Dynamic Preempt: full
[ 7781.920511] usb 1-1.2: new low-speed USB device number 3 using ehci-pci
[ 7782.034763] usb 1-1.2: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 7782.034785] usb 1-1.2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 7782.034793] usb 1-1.2: Product: USB-PS/2 Optical Mouse
[ 7782.034801] usb 1-1.2: Manufacturer: Logitech
[ 7782.161272] BPF: 	 type_id=197 bits_offset=64
[ 7782.161294] BPF:  
[ 7782.161300] BPF: Invalid name
[ 7782.161306] BPF: 
[ 7782.161318] failed to validate module [hid] BTF: -22
[ 7788.993019] usb 1-1.2: USB disconnect, device number 3
[ 7792.520096] usb 1-1.1: new low-speed USB device number 4 using ehci-pci
[ 7792.634489] usb 1-1.1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 7792.634511] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 7792.634520] usb 1-1.1: Product: USB-PS/2 Optical Mouse
[ 7792.634527] usb 1-1.1: Manufacturer: Logitech
[ 7792.680035] BPF: 	 type_id=197 bits_offset=64
[ 7792.680049] BPF:  
[ 7792.680052] BPF: Invalid name
[ 7792.680055] BPF: 
[ 7792.680062] failed to validate module [hid] BTF: -22
[ 8374.637649] usb 1-1.1: USB disconnect, device number 4
[ 8468.801317] usb 1-1.1: new low-speed USB device number 5 using ehci-pci
[ 8468.918683] usb 1-1.1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 8468.918704] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 8468.918711] usb 1-1.1: Product: USB-PS/2 Optical Mouse
[ 8468.918717] usb 1-1.1: Manufacturer: Logitech
[ 8469.123039] BPF: 	 type_id=197 bits_offset=64
[ 8469.123052] BPF:  
[ 8469.123055] BPF: Invalid name
[ 8469.123058] BPF: 
[ 8469.123064] failed to validate module [hid] BTF: -22
[ 8542.050848] usb 1-1.1: USB disconnect, device number 5
[ 8548.614912] usb 3-1: new low-speed USB device number 2 using xhci_hcd
[ 8548.799008] usb 3-1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 8548.799023] usb 3-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 8548.799028] usb 3-1: Product: USB-PS/2 Optical Mouse
[ 8548.799031] usb 3-1: Manufacturer: Logitech
[ 8548.833280] BPF: 	 type_id=197 bits_offset=64
[ 8548.833297] BPF:  
[ 8548.833300] BPF: Invalid name
[ 8548.833303] BPF: 
[ 8548.833310] failed to validate module [hid] BTF: -22
[ 8557.994985] usb 3-1: USB disconnect, device number 2
[ 8561.072351] usb 1-1.2: new low-speed USB device number 6 using ehci-pci
[ 8561.186414] usb 1-1.2: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 8561.186431] usb 1-1.2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 8561.186435] usb 1-1.2: Product: USB-PS/2 Optical Mouse
[ 8561.186438] usb 1-1.2: Manufacturer: Logitech
[ 8561.216757] BPF: 	 type_id=197 bits_offset=64
[ 8561.216771] BPF:  
[ 8561.216774] BPF: Invalid name
[ 8561.216777] BPF: 
[ 8561.216784] failed to validate module [hid] BTF: -22
[ 8729.580134] Dynamic Preempt: voluntary
[ 8925.765478] Dynamic Preempt: full
[ 8998.571077] usb 1-1.2: USB disconnect, device number 6
[ 9003.684035] usb 1-1.2: new full-speed USB device number 7 using ehci-pci
[ 9003.795195] usb 1-1.2: New USB device found, idVendor=046d, idProduct=c534, bcdDevice=29.01
[ 9003.795211] usb 1-1.2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 9003.795216] usb 1-1.2: Product: USB Receiver
[ 9003.795219] usb 1-1.2: Manufacturer: Logitech
[ 9003.922935] BPF: 	 type_id=197 bits_offset=64
[ 9003.922948] BPF:  
[ 9003.922951] BPF: Invalid name
[ 9003.922954] BPF: 
[ 9003.922960] failed to validate module [hid] BTF: -22
[ 9003.970384] BPF: 	 type_id=197 bits_offset=64
[ 9003.970398] BPF:  
[ 9003.970401] BPF: Invalid name
[ 9003.970404] BPF: 
[ 9003.970411] failed to validate module [hid] BTF: -22
[ 9291.156065] usb 1-1.1: new low-speed USB device number 8 using ehci-pci
[ 9291.270522] usb 1-1.1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 9291.270544] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 9291.270553] usb 1-1.1: Product: USB-PS/2 Optical Mouse
[ 9291.270560] usb 1-1.1: Manufacturer: Logitech
[ 9291.320955] BPF: 	 type_id=197 bits_offset=64
[ 9291.320972] BPF:  
[ 9291.320977] BPF: Invalid name
[ 9291.320982] BPF: 
[ 9291.320991] failed to validate module [hid] BTF: -22
[ 9328.371702] usb 2-1.1: USB disconnect, device number 3
[ 9819.247130] usb 1-1.1: USB disconnect, device number 8
[ 9898.564311] usb 1-1.1: new low-speed USB device number 9 using ehci-pci
[ 9898.678501] usb 1-1.1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[ 9898.678524] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 9898.678533] usb 1-1.1: Product: USB-PS/2 Optical Mouse
[ 9898.678540] usb 1-1.1: Manufacturer: Logitech
[ 9898.725640] BPF: 	 type_id=197 bits_offset=64
[ 9898.725661] BPF:  
[ 9898.725667] BPF: Invalid name
[ 9898.725673] BPF: 
[ 9898.725685] failed to validate module [hid] BTF: -22
[11331.750326] usb 1-1.1: USB disconnect, device number 9
[12383.994711] usb 1-1.1: new low-speed USB device number 10 using ehci-pci
[12384.108759] usb 1-1.1: New USB device found, idVendor=046d, idProduct=c03f, bcdDevice=20.00
[12384.108782] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[12384.108791] usb 1-1.1: Product: USB-PS/2 Optical Mouse
[12384.108798] usb 1-1.1: Manufacturer: Logitech
[12384.156644] BPF: 	 type_id=197 bits_offset=64
[12384.156664] BPF:  
[12384.156670] BPF: Invalid name
[12384.156676] BPF: 
[12384.156687] failed to validate module [hid] BTF: -22
[13095.153944] BPF: 	 type_id=197 bits_offset=64
[13095.153964] BPF:  
[13095.153970] BPF: Invalid name
[13095.153975] BPF: 
[13095.153982] failed to validate module [nvram] BTF: -22
[13095.523846] BPF: 	 type_id=197 bits_offset=64
[13095.523866] BPF:  
[13095.523871] BPF: Invalid name
[13095.523877] BPF: 
[13095.523886] failed to validate module [st] BTF: -22
