[    0.000000] Linux version 6.0.12-76060006-generic (XXX@XXX) (x86_64-linux-gnu-gcc-11 (Ubuntu 11.2.0-19ubuntu1) 11.2.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #202212290932~1671652965~22.04~452ea9d SMP PREEMPT_DYNAMIC Wed D
[    0.000000] Command line: initrd=\EFI\Pop_OS-XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX\initrd.img root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX ro quiet loglevel=0 systemd.show_status=false splash
[    0.000000] KERNEL supported cpus:
[    0.000000]   Intel GenuineIntel
[    0.000000]   AMD AuthenticAMD
[    0.000000]   Hygon HygonGenuine
[    0.000000]   Centaur CentaurHauls
[    0.000000]   zhaoxin   Shanghai  
[    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
[    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
[    0.000000] x86/fpu: Enabled xstate features 0x7, context size is 832 bytes, using 'standard' format.
[    0.000000] signal: max sigframe size: 1776
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000006dfff] usable
[    0.000000] BIOS-e820: [mem 0x000000000006e000-0x000000000006ffff] ACPI NVS
[    0.000000] BIOS-e820: [mem 0x0000000000070000-0x0000000000085fff] usable
[    0.000000] BIOS-e820: [mem 0x0000000000086000-0x00000000000bffff] reserved

[   13.148757] pstore: Using crash dump compression: deflate
[   13.150373] io scheduler bfq registered
[   13.255585] pstore: Registered efi as persistent store backend
[   13.405365] mc: Linux media interface: v0.10
[   13.543807] Bluetooth: Core ver 2.22
[   13.543875] NET: Registered PF_BLUETOOTH protocol family
[   13.543879] Bluetooth: HCI device and connection manager initialized
[   13.543889] Bluetooth: HCI socket layer initialized
[   13.543895] Bluetooth: L2CAP socket layer initialized
[   13.543906] Bluetooth: SCO socket layer initialized
[   13.594978] kvm: support for 'kvm_amd' disabled by bios
[   13.597923] FAT-fs (sda1): Volume was not properly unmounted. Some data may be corrupt. Please run fsck.
[   13.620156] FAT-fs (sda2): Volume was not properly unmounted. Some data may be corrupt. Please run fsck.
[   13.667172] videodev: Linux video capture interface: v2.00
[   13.669298] kvm: support for 'kvm_amd' disabled by bios
[   13.728481] MCE: In-kernel MCE decoding enabled.
[   13.730538] Bluetooth: hci0: RTL: examining hci_ver=06 hci_rev=000b lmp_ver=06 lmp_subver=8723
[   13.732370] Bluetooth: hci0: RTL: rom_version status=0 version=1
[   13.732384] Bluetooth: hci0: RTL: loading rtl_bt/rtl8723b_fw.bin
[   13.733990] usbcore: registered new interface driver btusb
[   13.734394] Bluetooth: hci0: RTL: loading rtl_bt/rtl8723b_config.bin
[   13.734485] bluetooth hci0: Direct firmware load for rtl_bt/rtl8723b_config.bin failed with error -2
[   13.734508] Bluetooth: hci0: RTL: cfg_sz -2, total sz 22496
[   14.080157] kvm: support for 'kvm_amd' disabled by bios
[   14.194046] kvm: support for 'kvm_amd' disabled by bios
[   14.219542] rtl8723be: Using firmware rtlwifi/rtl8723befw_36.bin
[   14.235080] ieee80211 phy0: Selected rate control algorithm 'rtl_rc'
[   14.254592] rtlwifi: rtlwifi: wireless switch is on
[   14.274977] rtl8723be 0000:02:00.0 wlp2s0: renamed from wlan0
[   14.297791] usb 2-1.1: Found UVC 1.00 device HP Truevision HD (0bda:57d6)
[   14.308511] snd_hda_intel 0000:00:01.1: Force to non-snoop mode
[   14.328590] input: HP Truevision HD: HP Truevision as /devices/pci0000:00/0000:00:13.0/usb2/2-1/2-1.1/2-1.1:1.0/input/input9
[   14.328784] usbcore: registered new interface driver uvcvideo
[   14.340814] input: HDA ATI HDMI HDMI/DP,pcm=3 as /devices/pci0000:00/0000:00:01.1/sound/card0/input10
[   14.391356] snd_hda_codec_realtek hdaudioC1D0: autoconfig for ALC3227: line_outs=1 (0x14/0x0/0x0/0x0/0x0) type:speaker
[   14.391373] snd_hda_codec_realtek hdaudioC1D0:    speaker_outs=0 (0x0/0x0/0x0/0x0/0x0)
[   14.391378] snd_hda_codec_realtek hdaudioC1D0:    hp_outs=1 (0x21/0x0/0x0/0x0/0x0)
[   14.391383] snd_hda_codec_realtek hdaudioC1D0:    mono: mono_out=0x0
[   14.391387] snd_hda_codec_realtek hdaudioC1D0:    inputs:
[   14.391391] snd_hda_codec_realtek hdaudioC1D0:      Mic=0x19
[   14.391395] snd_hda_codec_realtek hdaudioC1D0:      Internal Mic=0x12
[   14.448003] Adding 4193784k swap on /dev/mapper/XXXXXXXXXX  Priority:-2 extents:1 across:4193784k SSFS
[   14.453887] input: HD-Audio Generic Mic as /devices/pci0000:00/0000:00:14.2/sound/card1/input11
[   14.454043] input: HD-Audio Generic Headphone as /devices/pci0000:00/0000:00:14.2/sound/card1/input12
[   14.489950] input: HP WMI hotkeys as /devices/virtual/input/input8
[   14.674393] Bluetooth: hci0: RTL: fw version 0x0e2f9f73
[   15.094931] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[   15.094947] Bluetooth: BNEP filters: protocol multicast
[   15.094959] Bluetooth: BNEP socket layer initialized
[   15.102413] Bluetooth: MGMT ver 1.22
[   15.146994] NET: Registered PF_ALG protocol family
[   15.812200] Dynamic Preempt: full
[   15.876922] RTL8208 Fast Ethernet r8169-0-300:00: attached PHY driver (mii_bus:phy_addr=r8169-0-300:00, irq=MAC)
[   16.181559] r8169 0000:03:00.0 enp3s0: Link is Down
[   17.311570] loop2: detected capacity change from 0 to 8
[   18.132995] Bluetooth: RFCOMM TTY layer initialized
[   18.133024] Bluetooth: RFCOMM socket layer initialized
[   18.133037] Bluetooth: RFCOMM ver 1.11
[   18.586042] wlp2s0: authenticate with XXX
[   18.628605] wlp2s0: bad VHT capabilities, disabling VHT
[   18.628622] wlp2s0: 80 MHz not supported, disabling VHT
[   18.645489] wlp2s0: send auth to XXX (try 1/3)
[   18.647743] wlp2s0: authenticated
[   18.672721] wlp2s0: associate with XXX (try 1/3)
[   18.679117] wlp2s0: RX AssocResp from XXX (capab=0x1411 status=0 aid=2)
[   18.679376] wlp2s0: associated
[   18.917472] IPv6: ADDRCONF(NETDEV_CHANGE): wlp2s0: link becomes ready
[   18.921133] wlp2s0: Limiting TX power to 20 (20 - 0) dBm as advertised by XXX
[   23.938883] rfkill: input handler disabled
[   54.665269] rfkill: input handler enabled
[   63.811652] rfkill: input handler disabled
[  223.648893] Dynamic Preempt: voluntary
[  291.743613] r8169 0000:03:00.0 enp3s0: Link is Up - 100Mbps/Full - flow control off
[  291.743648] IPv6: ADDRCONF(NETDEV_CHANGE): enp3s0: link becomes ready
[  671.367052] systemd[1]: systemd 249.11-0ubuntu3.6pop0~1674074077~22.04~d0333cb running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT +GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[  671.367542] systemd[1]: Detected architecture x86-64.
[  673.107197] systemd-journald[370]: Received SIGTERM from PID 1 (systemd).
[  673.107651] systemd[1]: Stopping Journal Service...
[  673.119035] systemd[1]: resolvconf-pull-resolved.service: Deactivated successfully.
[  673.119808] systemd[1]: Finished resolvconf-pull-resolved.service.
[  673.205784] systemd[1]: systemd-journald.service: Deactivated successfully.
[  673.206909] systemd[1]: Stopped Journal Service.
[  673.207026] systemd[1]: systemd-journald.service: Consumed 1.593s CPU time.
[  673.235393] systemd[1]: Starting Journal Service...
[  673.541111] systemd[1]: Started Journal Service.
[  777.907458] BPF: 	 type_id=2023 bits_offset=0
[  777.907473] BPF:  
[  777.907477] BPF: Invalid name
[  777.907481] BPF: 
[  777.907486] failed to validate module [cpuid] BTF: -22
[  880.972079] BPF: 	 type_id=2023 bits_offset=0
[  880.972095] BPF:  
[  880.972100] BPF: Invalid name
[  880.972103] BPF: 
[  880.972111] failed to validate module [zram] BTF: -22
[  896.154297] loop2: detected capacity change from 0 to 8
[  899.070030] loop2: detected capacity change from 0 to 8
[ 1137.403397] r8169 0000:03:00.0 enp3s0: Link is Down
[ 1370.158831] usb 4-1: new SuperSpeed USB device number 2 using xhci_hcd
[ 1370.184204] usb 4-1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1370.184218] usb 4-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1370.184222] usb 4-1: Product: External USB 3.0
[ 1370.184225] usb 4-1: Manufacturer: TOSHIBA
[ 1370.184228] usb 4-1: SerialNumber: ...
[ 1370.287598] BPF: 	 type_id=2023 bits_offset=0
[ 1370.287613] BPF:  
[ 1370.287617] BPF: Invalid name
[ 1370.287620] BPF: 
[ 1370.287627] failed to validate module [usb_storage] BTF: -22
[ 1370.341698] BPF: 	 type_id=2023 bits_offset=0
[ 1370.341715] BPF:  
[ 1370.341720] BPF: Invalid name
[ 1370.341724] BPF: 
[ 1370.341732] failed to validate module [usb_storage] BTF: -22
[ 1388.251982] Dynamic Preempt: full
[ 1442.051437] usb 4-1: USB disconnect, device number 2
[ 1455.058272] usb 3-2: new high-speed USB device number 2 using xhci_hcd
[ 1458.454463] usb 4-1: new SuperSpeed USB device number 3 using xhci_hcd
[ 1458.479482] usb 4-1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1458.479499] usb 4-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1458.479504] usb 4-1: Product: External USB 3.0
[ 1458.479509] usb 4-1: Manufacturer: TOSHIBA
[ 1458.479513] usb 4-1: SerialNumber: ...
[ 1458.512198] BPF: 	 type_id=2023 bits_offset=0
[ 1458.512215] BPF:  
[ 1458.512218] BPF: Invalid name
[ 1458.512222] BPF: 
[ 1458.512227] failed to validate module [usb_storage] BTF: -22
[ 1458.568417] BPF: 	 type_id=2023 bits_offset=0
[ 1458.568432] BPF:  
[ 1458.568435] BPF: Invalid name
[ 1458.568438] BPF: 
[ 1458.568445] failed to validate module [usb_storage] BTF: -22
[ 1591.965735] usb 4-1: USB disconnect, device number 3
[ 1607.077532] usb 1-1.1: new high-speed USB device number 4 using ehci-pci
[ 1607.187773] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1607.187787] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1607.187791] usb 1-1.1: Product: External USB 3.0
[ 1607.187795] usb 1-1.1: Manufacturer: TOSHIBA
[ 1607.187798] usb 1-1.1: SerialNumber: ...
[ 1607.211221] BPF: 	 type_id=2023 bits_offset=0
[ 1607.211240] BPF:  
[ 1607.211243] BPF: Invalid name
[ 1607.211247] BPF: 
[ 1607.211254] failed to validate module [usb_storage] BTF: -22
[ 1607.270309] BPF: 	 type_id=2023 bits_offset=0
[ 1607.270322] BPF:  
[ 1607.270325] BPF: Invalid name
[ 1607.270328] BPF: 
[ 1607.270334] failed to validate module [usb_storage] BTF: -22
[ 1607.929568] usb 1-1.1: USB disconnect, device number 4
[ 1608.153672] usb 1-1.1: new high-speed USB device number 5 using ehci-pci
[ 1608.268004] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1608.268018] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1608.268022] usb 1-1.1: Product: External USB 3.0
[ 1608.268026] usb 1-1.1: Manufacturer: TOSHIBA
[ 1608.268029] usb 1-1.1: SerialNumber: ...
[ 1608.290599] BPF: 	 type_id=2023 bits_offset=0
[ 1608.290614] BPF:  
[ 1608.290617] BPF: Invalid name
[ 1608.290620] BPF: 
[ 1608.290626] failed to validate module [usb_storage] BTF: -22
[ 1608.338335] BPF: 	 type_id=2023 bits_offset=0
[ 1608.338349] BPF:  
[ 1608.338352] BPF: Invalid name
[ 1608.338355] BPF: 
[ 1608.338361] failed to validate module [usb_storage] BTF: -22
[ 1609.465088] usb 1-1-port1: disabled by hub (EMI?), re-enabling...
[ 1609.465112] usb 1-1.1: USB disconnect, device number 5
[ 1609.697528] usb 1-1.1: new full-speed USB device number 6 using ehci-pci
[ 1609.857680] usb 1-1.1: new high-speed USB device number 7 using ehci-pci
[ 1609.968027] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1609.968040] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1609.968044] usb 1-1.1: Product: External USB 3.0
[ 1609.968048] usb 1-1.1: Manufacturer: TOSHIBA
[ 1609.968051] usb 1-1.1: SerialNumber: ...
[ 1609.989784] BPF: 	 type_id=2023 bits_offset=0
[ 1609.989801] BPF:  
[ 1609.989804] BPF: Invalid name
[ 1609.989808] BPF: 
[ 1609.989813] failed to validate module [usb_storage] BTF: -22
[ 1610.030284] BPF: 	 type_id=2023 bits_offset=0
[ 1610.030298] BPF:  
[ 1610.030301] BPF: Invalid name
[ 1610.030304] BPF: 
[ 1610.030310] failed to validate module [usb_storage] BTF: -22
[ 1611.769014] usb 1-1.1: USB disconnect, device number 7
[ 1611.993650] usb 1-1.1: new high-speed USB device number 8 using ehci-pci
[ 1612.105994] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1612.106008] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1612.106012] usb 1-1.1: Product: External USB 3.0
[ 1612.106016] usb 1-1.1: Manufacturer: TOSHIBA
[ 1612.106019] usb 1-1.1: SerialNumber: ...
[ 1612.130121] BPF: 	 type_id=2023 bits_offset=0
[ 1612.130135] BPF:  
[ 1612.130138] BPF: Invalid name
[ 1612.130142] BPF: 
[ 1612.130146] failed to validate module [usb_storage] BTF: -22
[ 1612.182297] BPF: 	 type_id=2023 bits_offset=0
[ 1612.182311] BPF:  
[ 1612.182314] BPF: Invalid name
[ 1612.182316] BPF: 
[ 1612.182322] failed to validate module [usb_storage] BTF: -22
[ 1613.816787] usb 1-1.1: USB disconnect, device number 8
[ 1614.045486] usb 1-1.1: new high-speed USB device number 9 using ehci-pci
[ 1614.157981] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1614.157998] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1614.158003] usb 1-1.1: Product: External USB 3.0
[ 1614.158007] usb 1-1.1: Manufacturer: TOSHIBA
[ 1614.158011] usb 1-1.1: SerialNumber: ...
[ 1614.179523] BPF: 	 type_id=2023 bits_offset=0
[ 1614.179536] BPF:  
[ 1614.179540] BPF: Invalid name
[ 1614.179543] BPF: 
[ 1614.179549] failed to validate module [usb_storage] BTF: -22
[ 1614.246813] BPF: 	 type_id=2023 bits_offset=0
[ 1614.246830] BPF:  
[ 1614.246834] BPF: Invalid name
[ 1614.246837] BPF: 
[ 1614.246843] failed to validate module [usb_storage] BTF: -22
[ 1615.352327] usb 1-1.1: USB disconnect, device number 9
[ 1616.453632] usb 1-1.1: new high-speed USB device number 10 using ehci-pci
[ 1616.563821] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1616.563835] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1616.563839] usb 1-1.1: Product: External USB 3.0
[ 1616.563843] usb 1-1.1: Manufacturer: TOSHIBA
[ 1616.563846] usb 1-1.1: SerialNumber: ...
[ 1616.586873] BPF: 	 type_id=2023 bits_offset=0
[ 1616.586888] BPF:  
[ 1616.586891] BPF: Invalid name
[ 1616.586894] BPF: 
[ 1616.586899] failed to validate module [usb_storage] BTF: -22
[ 1616.646200] BPF: 	 type_id=2023 bits_offset=0
[ 1616.646213] BPF:  
[ 1616.646216] BPF: Invalid name
[ 1616.646218] BPF: 
[ 1616.646224] failed to validate module [usb_storage] BTF: -22
[ 1617.274102] usb 1-1.1: USB disconnect, device number 10
[ 1617.505557] usb 1-1.1: new high-speed USB device number 11 using ehci-pci
[ 1617.616380] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1617.616394] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1617.616398] usb 1-1.1: Product: External USB 3.0
[ 1617.616402] usb 1-1.1: Manufacturer: TOSHIBA
[ 1617.616405] usb 1-1.1: SerialNumber: ...
[ 1617.637859] BPF: 	 type_id=2023 bits_offset=0
[ 1617.637873] BPF:  
[ 1617.637876] BPF: Invalid name
[ 1617.637879] BPF: 
[ 1617.637885] failed to validate module [usb_storage] BTF: -22
[ 1617.690248] BPF: 	 type_id=2023 bits_offset=0
[ 1617.690263] BPF:  
[ 1617.690266] BPF: Invalid name
[ 1617.690269] BPF: 
[ 1617.690274] failed to validate module [usb_storage] BTF: -22
[ 1626.489209] usb 1-1.1: USB disconnect, device number 11
[ 1626.717543] usb 1-1.1: new high-speed USB device number 12 using ehci-pci
[ 1626.829702] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1626.829716] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1626.829720] usb 1-1.1: Product: External USB 3.0
[ 1626.829723] usb 1-1.1: Manufacturer: TOSHIBA
[ 1626.829726] usb 1-1.1: SerialNumber: ...
[ 1626.850762] BPF: 	 type_id=2023 bits_offset=0
[ 1626.850776] BPF:  
[ 1626.850778] BPF: Invalid name
[ 1626.850781] BPF: 
[ 1626.850787] failed to validate module [usb_storage] BTF: -22
[ 1626.898092] BPF: 	 type_id=2023 bits_offset=0
[ 1626.898105] BPF:  
[ 1626.898108] BPF: Invalid name
[ 1626.898111] BPF: 
[ 1626.898116] failed to validate module [usb_storage] BTF: -22
[ 1627.000931] usb 1-1.1: USB disconnect, device number 12
[ 1628.609459] usb 1-1.1: new high-speed USB device number 13 using ehci-pci
[ 1628.719783] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1628.719796] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1628.719800] usb 1-1.1: Product: External USB 3.0
[ 1628.719803] usb 1-1.1: Manufacturer: TOSHIBA
[ 1628.719806] usb 1-1.1: SerialNumber: ...
[ 1628.739154] BPF: 	 type_id=2023 bits_offset=0
[ 1628.739168] BPF:  
[ 1628.739170] BPF: Invalid name
[ 1628.739173] BPF: 
[ 1628.739180] failed to validate module [usb_storage] BTF: -22
[ 1628.786374] BPF: 	 type_id=2023 bits_offset=0
[ 1628.786390] BPF:  
[ 1628.786394] BPF: Invalid name
[ 1628.786397] BPF: 
[ 1628.786402] failed to validate module [usb_storage] BTF: -22
[ 1635.824462] usb 1-1.1: USB disconnect, device number 13
[ 1647.009464] usb 1-1.1: new high-speed USB device number 14 using ehci-pci
[ 1647.125915] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1647.125930] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1647.125935] usb 1-1.1: Product: External USB 3.0
[ 1647.125939] usb 1-1.1: Manufacturer: TOSHIBA
[ 1647.125943] usb 1-1.1: SerialNumber: ...
[ 1647.150155] BPF: 	 type_id=2023 bits_offset=0
[ 1647.150170] BPF:  
[ 1647.150173] BPF: Invalid name
[ 1647.150177] BPF: 
[ 1647.150185] failed to validate module [usb_storage] BTF: -22
[ 1647.198019] BPF: 	 type_id=2023 bits_offset=0
[ 1647.198033] BPF:  
[ 1647.198036] BPF: Invalid name
[ 1647.198039] BPF: 
[ 1647.198044] failed to validate module [usb_storage] BTF: -22
[ 1674.818600] usb 1-1.1: USB disconnect, device number 14
[ 1675.785191] usb 1-1.1: new high-speed USB device number 15 using ehci-pci
[ 1675.895614] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1675.895632] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1675.895637] usb 1-1.1: Product: External USB 3.0
[ 1675.895641] usb 1-1.1: Manufacturer: TOSHIBA
[ 1675.895645] usb 1-1.1: SerialNumber: ...
[ 1675.916260] BPF: 	 type_id=2023 bits_offset=0
[ 1675.916274] BPF:  
[ 1675.916277] BPF: Invalid name
[ 1675.916280] BPF: 
[ 1675.916287] failed to validate module [usb_storage] BTF: -22
[ 1675.965879] BPF: 	 type_id=2023 bits_offset=0
[ 1675.965894] BPF:  
[ 1675.965897] BPF: Invalid name
[ 1675.965900] BPF: 
[ 1675.965906] failed to validate module [usb_storage] BTF: -22
[ 1679.673736] usb 1-1.1: USB disconnect, device number 15
[ 1679.897282] usb 1-1.1: new high-speed USB device number 16 using ehci-pci
[ 1680.007813] usb 1-1.1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1680.007828] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1680.007832] usb 1-1.1: Product: External USB 3.0
[ 1680.007835] usb 1-1.1: Manufacturer: TOSHIBA
[ 1680.007838] usb 1-1.1: SerialNumber: ...
[ 1680.028132] BPF: 	 type_id=2023 bits_offset=0
[ 1680.028146] BPF:  
[ 1680.028149] BPF: Invalid name
[ 1680.028152] BPF: 
[ 1680.028158] failed to validate module [usb_storage] BTF: -22
[ 1680.082200] BPF: 	 type_id=2023 bits_offset=0
[ 1680.082214] BPF:  
[ 1680.082218] BPF: Invalid name
[ 1680.082220] BPF: 
[ 1680.082227] failed to validate module [usb_storage] BTF: -22
[ 1720.627914] usb 1-1-port1: disabled by hub (EMI?), re-enabling...
[ 1720.627937] usb 1-1.1: USB disconnect, device number 16
[ 1731.325244] usb 4-1: new SuperSpeed USB device number 4 using xhci_hcd
[ 1731.350412] usb 4-1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1731.350430] usb 4-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1731.350434] usb 4-1: Product: External USB 3.0
[ 1731.350438] usb 4-1: Manufacturer: TOSHIBA
[ 1731.350441] usb 4-1: SerialNumber: ...
[ 1731.376214] BPF: 	 type_id=2023 bits_offset=0
[ 1731.376230] BPF:  
[ 1731.376233] BPF: Invalid name
[ 1731.376237] BPF: 
[ 1731.376244] failed to validate module [usb_storage] BTF: -22
[ 1731.434256] BPF: 	 type_id=2023 bits_offset=0
[ 1731.434273] BPF:  
[ 1731.434276] BPF: Invalid name
[ 1731.434279] BPF: 
[ 1731.434285] failed to validate module [usb_storage] BTF: -22
[ 1761.384752] usb 4-1: USB disconnect, device number 4
[ 1770.748901] usb 4-1: new SuperSpeed USB device number 5 using xhci_hcd
[ 1770.777922] usb 4-1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 1770.777937] usb 4-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 1770.777942] usb 4-1: Product: External USB 3.0
[ 1770.777946] usb 4-1: Manufacturer: TOSHIBA
[ 1770.777949] usb 4-1: SerialNumber: ...
[ 1770.803530] BPF: 	 type_id=2023 bits_offset=0
[ 1770.803546] BPF:  
[ 1770.803549] BPF: Invalid name
[ 1770.803552] BPF: 
[ 1770.803558] failed to validate module [usb_storage] BTF: -22
[ 1770.845441] BPF: 	 type_id=2023 bits_offset=0
[ 1770.845456] BPF:  
[ 1770.845459] BPF: Invalid name
[ 1770.845462] BPF: 
[ 1770.845467] failed to validate module [usb_storage] BTF: -22
[ 1927.118988] sr 1:0:0:0: [sr0] tag#21 FAILED Result: hostbyte=DID_OK driverbyte=DRIVER_OK cmd_age=0s
[ 1927.119003] sr 1:0:0:0: [sr0] tag#21 Sense Key : Not Ready [current] 
[ 1927.119008] sr 1:0:0:0: [sr0] tag#21 Add. Sense: Medium not present - tray closed
[ 1927.119015] sr 1:0:0:0: [sr0] tag#21 CDB: Read(10) 28 00 00 00 00 00 00 00 08 00
[ 1927.119019] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x80700 phys_seg 4 prio class 3
[ 1927.119145] sr 1:0:0:0: [sr0] tag#5 unaligned transfer
[ 1927.119151] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119159] Buffer I/O error on dev sr0, logical block 0, async page read
[ 1927.119196] sr 1:0:0:0: [sr0] tag#6 unaligned transfer
[ 1927.119200] I/O error, dev sr0, sector 1 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119206] Buffer I/O error on dev sr0, logical block 1, async page read
[ 1927.119238] sr 1:0:0:0: [sr0] tag#7 unaligned transfer
[ 1927.119243] I/O error, dev sr0, sector 2 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119249] Buffer I/O error on dev sr0, logical block 2, async page read
[ 1927.119281] sr 1:0:0:0: [sr0] tag#8 unaligned transfer
[ 1927.119285] I/O error, dev sr0, sector 3 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119291] Buffer I/O error on dev sr0, logical block 3, async page read
[ 1927.119323] sr 1:0:0:0: [sr0] tag#9 unaligned transfer
[ 1927.119327] I/O error, dev sr0, sector 4 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119333] Buffer I/O error on dev sr0, logical block 4, async page read
[ 1927.119365] sr 1:0:0:0: [sr0] tag#10 unaligned transfer
[ 1927.119369] I/O error, dev sr0, sector 5 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119374] Buffer I/O error on dev sr0, logical block 5, async page read
[ 1927.119405] sr 1:0:0:0: [sr0] tag#11 unaligned transfer
[ 1927.119409] I/O error, dev sr0, sector 6 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119415] Buffer I/O error on dev sr0, logical block 6, async page read
[ 1927.119446] sr 1:0:0:0: [sr0] tag#12 unaligned transfer
[ 1927.119450] I/O error, dev sr0, sector 7 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1927.119456] Buffer I/O error on dev sr0, logical block 7, async page read
[ 1954.298886] sr 1:0:0:0: [sr0] tag#25 FAILED Result: hostbyte=DID_OK driverbyte=DRIVER_OK cmd_age=0s
[ 1954.298901] sr 1:0:0:0: [sr0] tag#25 Sense Key : Not Ready [current] 
[ 1954.298908] sr 1:0:0:0: [sr0] tag#25 Add. Sense: Medium not present - tray closed
[ 1954.298914] sr 1:0:0:0: [sr0] tag#25 CDB: Read(10) 28 00 00 00 00 00 00 00 08 00
[ 1954.298919] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x80700 phys_seg 4 prio class 3
[ 1954.299040] sr 1:0:0:0: [sr0] tag#1 unaligned transfer
[ 1954.299046] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299055] Buffer I/O error on dev sr0, logical block 0, async page read
[ 1954.299097] sr 1:0:0:0: [sr0] tag#2 unaligned transfer
[ 1954.299102] I/O error, dev sr0, sector 1 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299109] Buffer I/O error on dev sr0, logical block 1, async page read
[ 1954.299148] sr 1:0:0:0: [sr0] tag#3 unaligned transfer
[ 1954.299153] I/O error, dev sr0, sector 2 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299160] Buffer I/O error on dev sr0, logical block 2, async page read
[ 1954.299198] sr 1:0:0:0: [sr0] tag#4 unaligned transfer
[ 1954.299204] I/O error, dev sr0, sector 3 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299211] Buffer I/O error on dev sr0, logical block 3, async page read
[ 1954.299247] sr 1:0:0:0: [sr0] tag#5 unaligned transfer
[ 1954.299252] I/O error, dev sr0, sector 4 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299259] Buffer I/O error on dev sr0, logical block 4, async page read
[ 1954.299294] sr 1:0:0:0: [sr0] tag#6 unaligned transfer
[ 1954.299299] I/O error, dev sr0, sector 5 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299305] Buffer I/O error on dev sr0, logical block 5, async page read
[ 1954.299341] sr 1:0:0:0: [sr0] tag#7 unaligned transfer
[ 1954.299346] I/O error, dev sr0, sector 6 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299352] Buffer I/O error on dev sr0, logical block 6, async page read
[ 1954.299388] sr 1:0:0:0: [sr0] tag#8 unaligned transfer
[ 1954.299392] I/O error, dev sr0, sector 7 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 1954.299399] Buffer I/O error on dev sr0, logical block 7, async page read
[ 2064.534480] sr 1:0:0:0: [sr0] tag#17 FAILED Result: hostbyte=DID_OK driverbyte=DRIVER_OK cmd_age=0s
[ 2064.534497] sr 1:0:0:0: [sr0] tag#17 Sense Key : Not Ready [current] 
[ 2064.534504] sr 1:0:0:0: [sr0] tag#17 Add. Sense: Medium not present - tray closed
[ 2064.534510] sr 1:0:0:0: [sr0] tag#17 CDB: Read(10) 28 00 00 00 00 00 00 00 08 00
[ 2064.534515] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x80700 phys_seg 4 prio class 3
[ 2064.534638] sr 1:0:0:0: [sr0] tag#9 unaligned transfer
[ 2064.534644] I/O error, dev sr0, sector 0 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534653] Buffer I/O error on dev sr0, logical block 0, async page read
[ 2064.534694] sr 1:0:0:0: [sr0] tag#10 unaligned transfer
[ 2064.534699] I/O error, dev sr0, sector 1 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534706] Buffer I/O error on dev sr0, logical block 1, async page read
[ 2064.534741] sr 1:0:0:0: [sr0] tag#11 unaligned transfer
[ 2064.534746] I/O error, dev sr0, sector 2 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534753] Buffer I/O error on dev sr0, logical block 2, async page read
[ 2064.534796] sr 1:0:0:0: [sr0] tag#12 unaligned transfer
[ 2064.534800] I/O error, dev sr0, sector 3 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534805] Buffer I/O error on dev sr0, logical block 3, async page read
[ 2064.534836] sr 1:0:0:0: [sr0] tag#13 unaligned transfer
[ 2064.534840] I/O error, dev sr0, sector 4 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534846] Buffer I/O error on dev sr0, logical block 4, async page read
[ 2064.534876] sr 1:0:0:0: [sr0] tag#14 unaligned transfer
[ 2064.534880] I/O error, dev sr0, sector 5 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534885] Buffer I/O error on dev sr0, logical block 5, async page read
[ 2064.534916] sr 1:0:0:0: [sr0] tag#15 unaligned transfer
[ 2064.534920] I/O error, dev sr0, sector 6 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534925] Buffer I/O error on dev sr0, logical block 6, async page read
[ 2064.534956] sr 1:0:0:0: [sr0] tag#18 unaligned transfer
[ 2064.534960] I/O error, dev sr0, sector 7 op 0x0:(READ) flags 0x0 phys_seg 1 prio class 3
[ 2064.534965] Buffer I/O error on dev sr0, logical block 7, async page read
[ 3874.785423] usb 4-1: USB disconnect, device number 5
[ 3878.005728] usb 4-1: new SuperSpeed USB device number 6 using xhci_hcd
[ 3878.034652] usb 4-1: New USB device found, idVendor=0480, idProduct=a202, bcdDevice= 3.15
[ 3878.034667] usb 4-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 3878.034671] usb 4-1: Product: External USB 3.0
[ 3878.034674] usb 4-1: Manufacturer: TOSHIBA
[ 3878.034677] usb 4-1: SerialNumber: ...
[ 3878.062673] BPF: 	 type_id=2023 bits_offset=0
[ 3878.062691] BPF:  
[ 3878.062695] BPF: Invalid name
[ 3878.062698] BPF: 
[ 3878.062705] failed to validate module [usb_storage] BTF: -22
[ 3878.106096] BPF: 	 type_id=2023 bits_offset=0
[ 3878.106110] BPF:  
[ 3878.106114] BPF: Invalid name
[ 3878.106117] BPF: 
[ 3878.106123] failed to validate module [usb_storage] BTF: -22
[ 4219.900570] BPF: 	 type_id=2023 bits_offset=0
[ 4219.900584] BPF:  
[ 4219.900587] BPF: Invalid name
[ 4219.900590] BPF: 
[ 4219.900594] failed to validate module [nvram] BTF: -22
[ 4220.138873] BPF: 	 type_id=2023 bits_offset=0
[ 4220.138887] BPF:  
[ 4220.138890] BPF: Invalid name
[ 4220.138893] BPF: 
[ 4220.138897] failed to validate module [st] BTF: -22
