[    0.000000] Linux version 5.19.7-zen2-1-zen (XXX@XXX) (gcc (GCC) 12.2.0, GNU ld (GNU Binutils) 2.39.0) #1 ZEN SMP PREEMPT_DYNAMIC Mon, 05 Sep 2022 18:33:28 +0000
[    0.000000] Command line: BOOT_IMAGE=/boot/vmlinuz-linux-zen root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX rw resume=/dev/sda1 resume_offset=13993984 nvidia_drm.modeset=1
[    0.000000] x86/fpu: x87 FPU will use FXSAVE
[    0.000000] signal: max sigframe size: 1440
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000009f7ff] usable
[    0.000000] BIOS-e820: [mem 0x000000000009f800-0x000000000009ffff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000000e8000-0x00000000000fffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x00000000dfbc6aff] usable
[    0.000000] BIOS-e820: [mem 0x00000000dfbc6b00-0x00000000dfffffff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000f4000000-0x00000000f7ffffff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000fec00000-0x00000000fed3ffff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000fed45000-0x00000000ffffffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000100000000-0x000000021fffffff] usable
[    0.000000] NX (Execute Disable) protection: active
[    0.000000] SMBIOS 2.6 present.
[    0.000000] DMI: Hewlett-Packard HP Compaq 6005 Pro SFF PC/3047h, BIOS 786G6 v01.15 08/02/2011
[    0.000000] tsc: Fast TSC calibration using PIT
[    0.000000] tsc: Detected 3192.144 MHz processor

[   17.389508] acpi_cpufreq: overriding BIOS provided _PSD data
[   17.577122] tpm_tis 00:04: 1.2 TPM (device-id 0xB, rev-id 16)
[   17.600091] tpm tpm0: TPM is disabled/deactivated (0x7)
[   17.703406] i8042: PNP: PS/2 Controller [PNP0303:KBD,PNP0f0e:PS2M] at 0x60,0x64 irq 1,12
[   17.706590] serio: i8042 KBD port at 0x60,0x64 irq 1
[   17.706668] serio: i8042 AUX port at 0x60,0x64 irq 12
[   18.107243] input: PC Speaker as /devices/platform/pcspkr/input/input2
[   18.672798] piix4_smbus 0000:00:14.0: SMBus Host Controller at 0xfc00, revision 0
[   18.673079] piix4_smbus 0000:00:14.0: Auxiliary SMBus Host Controller at 0xfb00
[   18.848609] sp5100_tco: SP5100/SB800 TCO WatchDog Timer Driver
[   18.848874] sp5100-tco sp5100-tco: Failed to reserve MMIO or alternate MMIO region
[   18.848962] sp5100-tco: probe of sp5100-tco failed with error -16
[   19.455810] snd_hda_intel 0000:02:00.1: Disabling MSI
[   19.455819] snd_hda_intel 0000:02:00.1: Handle vga_switcheroo audio client
[   19.672813] tg3 0000:3f:00.0 eth0: Tigon3 [partno(BCM95761) rev 5761100] (PCI Express) MAC address XXX
[   19.672834] tg3 0000:3f:00.0 eth0: attached PHY is 5761 (10/100/1000Base-T Ethernet) (WireSpeed[1], EEE[0])
[   19.672844] tg3 0000:3f:00.0 eth0: RXcsums[1] LinkChgREG[0] MIirq[0] ASF[0] TSOcap[1]
[   19.672852] tg3 0000:3f:00.0 eth0: dma_rwctrl[76180000] dma_mask[64-bit]
[   19.709208] snd_hda_codec_realtek hdaudioC1D0: autoconfig for ALC662 rev1: line_outs=1 (0x14/0x0/0x0/0x0/0x0) type:line
[   19.709225] snd_hda_codec_realtek hdaudioC1D0:    speaker_outs=1 (0x15/0x0/0x0/0x0/0x0)
[   19.709228] snd_hda_codec_realtek hdaudioC1D0:    hp_outs=1 (0x1b/0x0/0x0/0x0/0x0)
[   19.709230] snd_hda_codec_realtek hdaudioC1D0:    mono: mono_out=0x0
[   19.709231] snd_hda_codec_realtek hdaudioC1D0:    inputs:
[   19.709232] snd_hda_codec_realtek hdaudioC1D0:      Mic=0x19
[   19.709234] snd_hda_codec_realtek hdaudioC1D0:      Line=0x18
[   19.727337] input: HDA ATI SB Mic as /devices/pci0000:00/0000:00:14.2/sound/card1/input6
[   19.727492] input: HDA ATI SB Line as /devices/pci0000:00/0000:00:14.2/sound/card1/input7
[   19.727636] input: HDA ATI SB Line Out as /devices/pci0000:00/0000:00:14.2/sound/card1/input8
[   19.727718] input: HDA ATI SB Front Headphone as /devices/pci0000:00/0000:00:14.2/sound/card1/input9
[   19.746386] input: HDA NVidia HDMI/DP,pcm=3 as /devices/pci0000:00/0000:00:02.0/0000:02:00.1/sound/card2/input10
[   19.749121] input: HDA NVidia HDMI/DP,pcm=7 as /devices/pci0000:00/0000:00:02.0/0000:02:00.1/sound/card2/input11
[   19.749193] input: HDA NVidia HDMI/DP,pcm=8 as /devices/pci0000:00/0000:00:02.0/0000:02:00.1/sound/card2/input12
[   19.749238] input: HDA NVidia HDMI/DP,pcm=9 as /devices/pci0000:00/0000:00:02.0/0000:02:00.1/sound/card2/input13
[   19.749283] input: HDA NVidia HDMI/DP,pcm=10 as /devices/pci0000:00/0000:00:02.0/0000:02:00.1/sound/card2/input14
[   19.865670] input: HID 6901:2701 as /devices/pci0000:00/0000:00:13.0/usb5/5-1/5-1:1.0/0003:6901:2701.0001/input/input15
[   19.915059] tg3 0000:3f:00.0 enp63s0: renamed from eth0
[   19.918321] hid-generic 0003:6901:2701.0001: input,hidraw0: USB HID v1.10 Keyboard [HID 6901:2701] on usb-0000:00:13.0-1/input0
[   19.928557] input: HID 6901:2701 Mouse as /devices/pci0000:00/0000:00:13.0/usb5/5-1/5-1:1.1/0003:6901:2701.0002/input/input16
[   19.928799] input: HID 6901:2701 Consumer Control as /devices/pci0000:00/0000:00:13.0/usb5/5-1/5-1:1.1/0003:6901:2701.0002/input/input17
[   19.959718] Bluetooth: Core ver 2.22
[   19.960514] NET: Registered PF_BLUETOOTH protocol family
[   19.960520] Bluetooth: HCI device and connection manager initialized
[   19.960532] Bluetooth: HCI socket layer initialized
[   19.960536] Bluetooth: L2CAP socket layer initialized
[   19.960547] Bluetooth: SCO socket layer initialized
[   19.960840] input: HP WMI hotkeys as /devices/virtual/input/input19
[   19.980201] input: HID 6901:2701 System Control as /devices/pci0000:00/0000:00:13.0/usb5/5-1/5-1:1.1/0003:6901:2701.0002/input/input18
[   19.981074] hid-generic 0003:6901:2701.0002: input,hidraw1: USB HID v1.10 Mouse [HID 6901:2701] on usb-0000:00:13.0-1/input1
[   19.985397] input: Logitech USB Optical Mouse as /devices/pci0000:00/0000:00:13.0/usb5/5-2/5-2:1.0/0003:046D:C05B.0003/input/input20
[   19.985561] hid-generic 0003:046D:C05B.0003: input,hidraw2: USB HID v1.11 Mouse [Logitech USB Optical Mouse] on usb-0000:00:13.0-2/input0
[   19.995520] input: CHICONY HP Basic USB Keyboard as /devices/pci0000:00/0000:00:12.1/usb4/4-3/4-3:1.0/0003:03F0:0024.0004/input/input21
[   20.047304] hid-generic 0003:03F0:0024.0004: input,hidraw3: USB HID v1.11 Keyboard [CHICONY HP Basic USB Keyboard] on usb-0000:00:12.1-3/input0
[   20.047355] usbcore: registered new interface driver usbhid
[   20.047357] usbhid: USB HID core driver
[   20.111557] mousedev: PS/2 mouse device common for all mice
[   20.130318] kvm: Nested Virtualization enabled
[   20.130323] SVM: kvm: Nested Paging enabled
[   20.130330] SVM: LBR virtualization supported
[   20.182308] MCE: In-kernel MCE decoding enabled.
[   20.207805] btusb: version magic '5.19.7-zen2-1-zen-1-zen SMP preempt mod_unload ' should be '5.19.7-zen2-1-zen SMP preempt mod_unload '
[   20.209884] btusb: version magic '5.19.7-zen2-1-zen-1-zen SMP preempt mod_unload ' should be '5.19.7-zen2-1-zen SMP preempt mod_unload '
[   20.210633] btusb: version magic '5.19.7-zen2-1-zen-1-zen SMP preempt mod_unload ' should be '5.19.7-zen2-1-zen SMP preempt mod_unload '
[   20.216247] btusb: version magic '5.19.7-zen2-1-zen-1-zen SMP preempt mod_unload ' should be '5.19.7-zen2-1-zen SMP preempt mod_unload '
[   25.199311] tg3 0000:3f:00.0 enp63s0: Link is up at 1000 Mbps, full duplex
[   25.199344] tg3 0000:3f:00.0 enp63s0: Flow control is off for TX and off for RX
[   25.199410] IPv6: ADDRCONF(NETDEV_CHANGE): enp63s0: link becomes ready
[   26.974642] systemd-journald[213]: File /var/log/journal/XXX/user-XXXX.journal corrupted or uncleanly shut down, renaming and replacing.
[ 1245.247879] BPF: 	 type_id=1416 bits_offset=0
[ 1245.247906] BPF:  
[ 1245.247912] BPF: Invalid name
[ 1245.247917] BPF: 
[ 1245.247926] failed to validate module [btusb] BTF: -22
[ 1310.550348] BPF: 	 type_id=1416 bits_offset=0
[ 1310.550355] BPF:  
[ 1310.550357] BPF: Invalid name
[ 1310.550358] BPF: 
[ 1310.550362] failed to validate module [btusb] BTF: -22
[ 1679.023954] BPF: 	 type_id=1416 bits_offset=0
[ 1679.023963] BPF:  
[ 1679.023965] BPF: Invalid name
[ 1679.023966] BPF: 
[ 1679.023970] failed to validate module [btusb] BTF: -22
[ 1694.439485] BPF: 	 type_id=1416 bits_offset=0
[ 1694.439494] BPF:  
[ 1694.439496] BPF: Invalid name
[ 1694.439497] BPF: 
[ 1694.439500] failed to validate module [btusb] BTF: -22
[ 1727.929501] BPF: 	 type_id=1416 bits_offset=0
[ 1727.929509] BPF:  
[ 1727.929511] BPF: Invalid name
[ 1727.929512] BPF: 
[ 1727.929516] failed to validate module [btusb] BTF: -22
[ 1736.612863] BPF: 	 type_id=1416 bits_offset=0
[ 1736.612872] BPF:  
[ 1736.612873] BPF: Invalid name
[ 1736.612875] BPF: 
[ 1736.612878] failed to validate module [btusb] BTF: -22
[ 4666.311482] PM: hibernation: hibernation entry
[ 4669.244979] Filesystems sync: 2.425 seconds
[ 4669.244989] Freezing user space processes ... (elapsed 0.255 seconds) done.
[ 4669.500801] OOM killer disabled.
[ 4669.501155] PM: hibernation: Marking nosave pages: [mem 0x00000000-0x00000fff]
[ 4669.501165] PM: hibernation: Marking nosave pages: [mem 0x0009f000-0x000fffff]
[ 4669.501176] PM: hibernation: Marking nosave pages: [mem 0xdfbc6000-0xffffffff]
[ 4669.503958] PM: hibernation: Basic memory bitmaps created
[ 4669.503994] PM: hibernation: Preallocating image memory
[ 4676.432522] PM: hibernation: Allocated 805979 pages for snapshot
[ 4676.432530] PM: hibernation: Allocated 3223916 kbytes in 6.92 seconds (465.88 MB/s)
[ 4676.432534] Freezing remaining freezable tasks ... (elapsed 0.001 seconds) done.
[ 4676.433712] printk: Suspending console(s) (use no_console_suspend to debug)
[ 4676.500657] serial 00:03: disabled
[ 4676.595123] ACPI: PM: Preparing to enter system sleep state S4
[ 4676.595301] ACPI: PM: Saving platform NVS memory
[ 4676.595316] Disabling non-boot CPUs ...
[ 4676.597152] smpboot: CPU 1 is now offline
[ 4676.598059] PM: hibernation: Creating image:
[ 4677.277540] PM: hibernation: Need to copy 805337 pages
[ 4677.277547] PM: hibernation: Normal pages needed: 805337 + 1024, available pages: 1290137
[ 4676.598237] unchecked MSR access error: WRMSR to 0xc0010020 (tried to write 0xffffffff982bf9a0) at rIP: 0xffffffff95c5f170 (reload_ucode_amd+0x20/0x50)
[ 4676.598248] Call Trace:
[ 4676.598251]  <TASK>
[ 4676.598252]  restore_processor_state+0x254/0x2e0
[ 4676.598259]  hibernation_snapshot+0x139/0x500
[ 4676.598262]  hibernate.cold+0x99/0x2d9
[ 4676.598265]  state_store+0xe2/0x140
[ 4676.598268]  kernfs_fop_write_iter+0x122/0x200
[ 4676.598271]  vfs_write+0x33b/0x490
[ 4676.598275]  __x64_sys_write+0x74/0xf0
[ 4676.598278]  do_syscall_64+0x5f/0x90
[ 4676.598282]  ? do_user_addr_fault+0x1e4/0x6a0
[ 4676.598284]  ? syscall_exit_to_user_mode+0x2c/0x1b0
[ 4676.598287]  ? exc_page_fault+0x74/0x170
[ 4676.598288]  entry_SYSCALL_64_after_hwframe+0x63/0xcd
[ 4676.598291] RIP: 0033:0x7f796170fe94
[ 4676.598294] Code: 15 f9 0e 0e 00 f7 d8 64 89 02 48 c7 c0 ff ff ff ff eb b7 0f 1f 00 f3 0f 1e fa 80 3d 8d 96 0e 00 00 74 13 b8 01 00 00 00 0f 05 <48> 3d 00 f0 ff ff 77 54 c3 0f 1f 00 48 83 ec 28 48 89 54 24 18 48
[ 4676.598297] RSP: 002b:00007fff86d8a058 EFLAGS: 00000202 ORIG_RAX: 0000000000000001
[ 4676.598300] RAX: ffffffffffffffda RBX: 0000000000000005 RCX: 00007f796170fe94
[ 4676.598301] RDX: 0000000000000005 RSI: 00007fff86d8a140 RDI: 0000000000000004
[ 4676.598302] RBP: 00007fff86d8a140 R08: fefefefefefefeff R09: feff7dff6a726863
[ 4676.598304] R10: 00005591b84b5143 R11: 0000000000000202 R12: 0000000000000005
[ 4676.598305] R13: 00005591b9eee3c0 R14: 0000000000000005 R15: 00007f79617ed940
[ 4676.598307]  </TASK>
[ 4676.598357] ACPI: PM: Restoring platform NVS memory
[ 4676.598375] LVT offset 1 assigned for vector 0x400
[ 4676.598385] LVT offset 1 assigned
[ 4676.598710] Enabling non-boot CPUs ...
[ 4676.598767] x86: Booting SMP configuration:
[ 4676.598768] smpboot: Booting Node 0 Processor 1 APIC 0x1
[ 4676.598896] microcode: CPU1: patch_level=0x010000b6
[ 4676.601626] CPU1 is up
[ 4676.601945] ACPI: PM: Waking up from system sleep state S4
[ 4676.703049] tg3 0000:3f:00.0 enp63s0: Link is down
[ 4676.706908] serial 00:03: activated
[ 4676.762170] usb usb5: root hub lost power or was reset
[ 4676.763224] usb usb6: root hub lost power or was reset
[ 4676.764310] usb usb4: root hub lost power or was reset
[ 4676.772177] tpm tpm0: TPM is disabled/deactivated (0x7)
[ 4676.777877] usb usb2: root hub lost power or was reset
[ 4676.779034] sd 0:0:0:0: [sda] Starting disk
[ 4676.925922] usb usb7: root hub lost power or was reset
[ 4676.927925] usb usb3: root hub lost power or was reset
[ 4676.927952] usb usb1: root hub lost power or was reset
[ 4677.010793] ata4: SATA link down (SStatus 0 SControl 300)
[ 4677.010837] ata5: SATA link down (SStatus 0 SControl 300)
[ 4677.010872] ata6: SATA link down (SStatus 0 SControl 300)
[ 4677.073342] ata3: SATA link down (SStatus 0 SControl 300)
[ 4677.073386] ata2: SATA link up 1.5 Gbps (SStatus 113 SControl 300)
[ 4677.076693] ata2.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.076700] ata2.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.081039] ata2.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.081044] ata2.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.081049] ata2.00: configured for UDMA/100
[ 4677.081338] ata1: SATA link up 3.0 Gbps (SStatus 123 SControl 300)
[ 4677.082446] ata1.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.082452] ata1.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.082862] ata1.00: ACPI cmd b1/XXX(DEVICE CONFIGURATION OVERLAY) filtered out
[ 4677.082868] ata1.00: ACPI cmd f5/XXX(SECURITY FREEZE LOCK) filtered out
[ 4677.085309] ata1.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.085314] ata1.00: ACPI cmd ef/XXX(SET FEATURES) filtered out
[ 4677.085795] ata1.00: ACPI cmd b1/XXX(DEVICE CONFIGURATION OVERLAY) filtered out
[ 4677.085802] ata1.00: ACPI cmd f5/XXX(SECURITY FREEZE LOCK) filtered out
[ 4677.086998] ata1.00: configured for UDMA/133
[ 4677.247171] usb 5-2: reset low-speed USB device number 3 using ohci-pci
[ 4677.255135] usb 3-3: reset full-speed USB device number 2 using ohci-pci
[ 4677.359168] usb 4-3: reset low-speed USB device number 2 using ohci-pci
[ 4677.823176] usb 5-1: reset low-speed USB device number 2 using ohci-pci
[ 4678.141627] PM: hibernation: Basic memory bitmaps freed
[ 4678.141632] OOM killer enabled.
[ 4678.141632] Restarting tasks ... done.
[ 4678.164614] PM: hibernation: hibernation exit
[ 4679.308410] tg3 0000:3f:00.0 enp63s0: Link is up at 1000 Mbps, full duplex
[ 4679.308436] tg3 0000:3f:00.0 enp63s0: Flow control is off for TX and off for RX
[ 4689.942783] tg3 0000:3f:00.0 enp63s0: Link is up at 1000 Mbps, full duplex
[ 4689.942807] tg3 0000:3f:00.0 enp63s0: Flow control is off for TX and off for RX
[ 4689.942865] IPv6: ADDRCONF(NETDEV_CHANGE): enp63s0: link becomes ready
[ 5829.591611] perf: interrupt took too long (2519 > 2500), lowering kernel.perf_event_max_sample_rate to 79000
[ 7021.295686] BPF: 	 type_id=1416 bits_offset=0
[ 7021.295702] BPF:  
[ 7021.295708] BPF: Invalid name
[ 7021.295713] BPF: 
[ 7021.295722] failed to validate module [btusb] BTF: -22
[ 7027.019173] btusb: bad vermagic: kernel tainted.
[ 7027.026067] BPF: 	 type_id=1416 bits_offset=0
[ 7027.026075] BPF:  
[ 7027.026076] BPF: Invalid name
[ 7027.026078] BPF: 
[ 7027.026081] failed to validate module [btusb] BTF: -22
[ 7479.847302] usbcore: registered new interface driver btusb
[ 7480.025156] Bluetooth: hci0: Opcode 0x c0d failed: -95
[ 7487.531114] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[ 7487.531121] Bluetooth: BNEP filters: protocol multicast
[ 7487.531129] Bluetooth: BNEP socket layer initialized
[ 7511.114987] st: Version 20160209, fixed bufsize 32768, s/g segs 256
[ 7511.311349] sd 0:0:0:0: Attached scsi generic sg0 type 0
[ 7511.311403] sr 1:0:0:0: Attached scsi generic sg1 type 5
