[1419723.218445] input: py-evdev-uinput as /devices/virtual/input/input38
[1433356.366884] usb 3-1: new full-speed USB device number 29 using xhci_hcd
[1433356.543912] usb 3-1: New USB device found, idVendor=0b0e, idProduct=245d, bcdDevice= 1.87
[1433356.543916] usb 3-1: New USB device strings: Mfr=0, Product=2, SerialNumber=...
[1433356.543917] usb 3-1: Product: Jabra Link 370
[1433356.543918] usb 3-1: SerialNumber: ...
[1433356.584617] BPF: 	 type_id=1372 bits_offset=192
[1433356.584622] BPF:  
[1433356.584623] BPF: Invalid name
[1433356.584625] BPF: 
[1433356.584627] failed to validate module [mc] BTF: -22
[1433356.584699] BPF: 	 type_id=1651 bits_offset=1408
[1433356.584703] BPF:  
[1433356.584704] BPF: Invalid name
[1433356.584705] BPF: 
[1433356.584707] failed to validate module [hid_jabra] BTF: -22
[1433363.053459] input: ... (AVRCP) as /devices/virtual/input/input39
[1501225.061557] input: ... (AVRCP) as /devices/virtual/input/input40
[1501241.846575] input: ... (AVRCP) as /devices/virtual/input/input41
[1501309.972888] Bluetooth: hci0: link tx timeout
[1501309.972895] Bluetooth: hci0: killing stalled connection XXX
[1501386.159252] usb 3-2: USB disconnect, device number 2
[1501412.198652] usb 1-3: new full-speed USB device number 70 using xhci_hcd
[1501412.373608] usb 1-3: New USB device found, idVendor=046d, idProduct=c52b, bcdDevice=12.11
[1501412.373611] usb 1-3: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1501412.373613] usb 1-3: Product: USB Receiver
[1501412.373614] usb 1-3: Manufacturer: Logitech
[1501412.423767] logitech-djreceiver 0003:046D:C52B.000D: hiddev0,hidraw0: USB HID v1.11 Device [Logitech USB Receiver] on usb-0000:06:00.1-3/input2
[1501412.557735] input: Logitech M720 Triathlon as /devices/pci0000:00/0000:00:01.2/0000:02:00.0/0000:03:08.0/0000:06:00.1/usb1/1-3/1-3:1.2/0003:046D:C52B.000D/0003:046D:405E.000E/input/input42
[1501412.557915] logitech-hidpp-device 0003:046D:405E.000E: input,hidraw1: USB HID v1.11 Keyboard [Logitech M720 Triathlon] on usb-0000:06:00.1-3/input2:1
[1501412.565729] input: Logitech K750 as /devices/pci0000:00/0000:00:01.2/0000:02:00.0/0000:03:08.0/0000:06:00.1/usb1/1-3/1-3:1.2/0003:046D:C52B.000D/0003:046D:400F.000F/input/input43
[1501412.565898] logitech-hidpp-device 0003:046D:400F.000F: input,hidraw2: USB HID v1.11 Keyboard [Logitech K750] on usb-0000:06:00.1-3/input2:2
[1501416.981633] logitech-hidpp-device 0003:046D:405E.000E: HID++ 4.5 device connected.
[1501421.171645] logitech-hidpp-device 0003:046D:400F.000F: HID++ 2.0 device connected.
[1501451.210516] usb 3-2: new high-speed USB device number 30 using xhci_hcd
[1501451.361805] usb 3-2: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1501451.361809] usb 3-2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1501451.361810] usb 3-2: Product: HD USB Camera
[1501451.361811] usb 3-2: Manufacturer: Ingenic Semiconductor CO., LTD.
[1501451.361812] usb 3-2: SerialNumber: ...
[1501451.403761] BPF: 	 type_id=1372 bits_offset=192
[1501451.403764] BPF:  
[1501451.403765] BPF: Invalid name
[1501451.403766] BPF: 
[1501451.403767] failed to validate module [mc] BTF: -22
[1501451.471318] BPF: 	 type_id=1372 bits_offset=192
[1501451.471322] BPF:  
[1501451.471323] BPF: Invalid name
[1501451.471324] BPF: 
[1501451.471325] failed to validate module [mc] BTF: -22
[1501472.965257] usb 3-2: USB disconnect, device number 30
[1501473.458443] usb 3-2: new high-speed USB device number 31 using xhci_hcd
[1501481.226433] usb 3-2: new high-speed USB device number 32 using xhci_hcd
[1501481.377746] usb 3-2: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1501481.377749] usb 3-2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1501481.377751] usb 3-2: Product: HD USB Camera
[1501481.377752] usb 3-2: Manufacturer: Ingenic Semiconductor CO., LTD.
[1501481.377753] usb 3-2: SerialNumber: ...
[1501481.415720] BPF: 	 type_id=1372 bits_offset=192
[1501481.415723] BPF:  
[1501481.415724] BPF: Invalid name
[1501481.415725] BPF: 
[1501481.415727] failed to validate module [mc] BTF: -22
[1501481.479190] BPF: 	 type_id=1372 bits_offset=192
[1501481.479194] BPF:  
[1501481.479195] BPF: Invalid name
[1501481.479196] BPF: 
[1501481.479198] failed to validate module [mc] BTF: -22
[1501502.359320] usb 3-2: USB disconnect, device number 32
[1501509.126316] usb 3-2: new high-speed USB device number 34 using xhci_hcd
[1501509.277682] usb 3-2: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1501509.277687] usb 3-2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1501509.277688] usb 3-2: Product: HD USB Camera
[1501509.277689] usb 3-2: Manufacturer: Ingenic Semiconductor CO., LTD.
[1501509.277690] usb 3-2: SerialNumber: ...
[1501509.319544] BPF: 	 type_id=1372 bits_offset=192
[1501509.319549] BPF:  
[1501509.319550] BPF: Invalid name
[1501509.319551] BPF: 
[1501509.319552] failed to validate module [mc] BTF: -22
[1501509.431108] BPF: 	 type_id=1372 bits_offset=192
[1501509.431112] BPF:  
[1501509.431113] BPF: Invalid name
[1501509.431114] BPF: 
[1501509.431116] failed to validate module [mc] BTF: -22
[1501523.164989] usb 3-2: USB disconnect, device number 34
[1501551.994165] usb 5-3: new high-speed USB device number 3 using xhci_hcd
[1501552.145428] usb 5-3: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1501552.145432] usb 5-3: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1501552.145433] usb 5-3: Product: HD USB Camera
[1501552.145434] usb 5-3: Manufacturer: Ingenic Semiconductor CO., LTD.
[1501552.145436] usb 5-3: SerialNumber: ...
[1501552.174557] BPF: 	 type_id=1372 bits_offset=192
[1501552.174560] BPF:  
[1501552.174561] BPF: Invalid name
[1501552.174562] BPF: 
[1501552.174564] failed to validate module [mc] BTF: -22
[1501552.258953] BPF: 	 type_id=1372 bits_offset=192
[1501552.258957] BPF:  
[1501552.258958] BPF: Invalid name
[1501552.258959] BPF: 
[1501552.258960] failed to validate module [mc] BTF: -22
[1501584.631587] usb 5-3: USB disconnect, device number 3
[1501786.063543] usb 3-1: USB disconnect, device number 29
[1501813.455508] usb 1-3: USB disconnect, device number 70
[1504765.192702] input: ... (AVRCP) as /devices/virtual/input/input44
[1504779.351144] input: ... (AVRCP) as /devices/virtual/input/input45
[1507942.339934] usb 3-2: new full-speed USB device number 35 using xhci_hcd
[1507942.510748] usb 3-2: New USB device found, idVendor=046d, idProduct=c52b, bcdDevice=12.11
[1507942.510752] usb 3-2: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1507942.510753] usb 3-2: Product: USB Receiver
[1507942.510754] usb 3-2: Manufacturer: Logitech
[1507942.558880] logitech-djreceiver 0003:046D:C52B.0012: hiddev0,hidraw0: USB HID v1.11 Device [Logitech USB Receiver] on usb-0000:06:00.3-2/input2
[1507942.690851] input: Logitech M720 Triathlon as /devices/pci0000:00/0000:00:01.2/0000:02:00.0/0000:03:08.0/0000:06:00.3/usb3/3-2/3-2:1.2/0003:046D:C52B.0012/0003:046D:405E.0013/input/input46
[1507942.690993] logitech-hidpp-device 0003:046D:405E.0013: input,hidraw1: USB HID v1.11 Keyboard [Logitech M720 Triathlon] on usb-0000:06:00.3-2/input2:1
[1507942.698873] input: Logitech K750 as /devices/pci0000:00/0000:00:01.2/0000:02:00.0/0000:03:08.0/0000:06:00.3/usb3/3-2/3-2:1.2/0003:046D:C52B.0012/0003:046D:400F.0014/input/input47
[1507942.699007] logitech-hidpp-device 0003:046D:400F.0014: input,hidraw2: USB HID v1.11 Keyboard [Logitech K750] on usb-0000:06:00.3-2/input2:2
[1507943.394771] logitech-hidpp-device 0003:046D:405E.0013: HID++ 4.5 device connected.
[1507944.482785] logitech-hidpp-device 0003:046D:400F.0014: HID++ 2.0 device connected.
[1508294.742721] usb 3-1: new high-speed USB device number 36 using xhci_hcd
[1508294.894054] usb 3-1: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1508294.894057] usb 3-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1508294.894059] usb 3-1: Product: HD USB Camera
[1508294.894060] usb 3-1: Manufacturer: Ingenic Semiconductor CO., LTD.
[1508294.894061] usb 3-1: SerialNumber: ...
[1508294.935479] BPF: 	 type_id=1372 bits_offset=192
[1508294.935484] BPF:  
[1508294.935485] BPF: Invalid name
[1508294.935486] BPF: 
[1508294.935487] failed to validate module [mc] BTF: -22
[1508295.031515] BPF: 	 type_id=1372 bits_offset=192
[1508295.031520] BPF:  
[1508295.031521] BPF: Invalid name
[1508295.031522] BPF: 
[1508295.031523] failed to validate module [mc] BTF: -22
[1508316.323132] usb 3-1: USB disconnect, device number 36
[1508325.018620] usb 3-1: new high-speed USB device number 37 using xhci_hcd
[1508325.169999] usb 3-1: New USB device found, idVendor=05a3, idProduct=9331, bcdDevice= 1.00
[1508325.170002] usb 3-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1508325.170003] usb 3-1: Product: HD USB Camera
[1508325.170004] usb 3-1: Manufacturer: Ingenic Semiconductor CO., LTD.
[1508325.170005] usb 3-1: SerialNumber: ...
[1508325.207531] BPF: 	 type_id=1372 bits_offset=192
[1508325.207535] BPF:  
[1508325.207536] BPF: Invalid name
[1508325.207537] BPF: 
[1508325.207538] failed to validate module [mc] BTF: -22
[1508325.287387] BPF: 	 type_id=1372 bits_offset=192
[1508325.287390] BPF:  
[1508325.287391] BPF: Invalid name
[1508325.287392] BPF: 
[1508325.287393] failed to validate module [mc] BTF: -22
[1509115.150839] input: ... (AVRCP) as /devices/virtual/input/input48
[1516605.538724] BPF: 	 type_id=1651 bits_offset=1408
[1516605.538729] BPF:  
[1516605.538730] BPF: Invalid name
[1516605.538731] BPF: 
[1516605.538732] failed to validate module [nvram] BTF: -22
[1516605.708043] BPF: 	 type_id=1651 bits_offset=1408
[1516605.708045] BPF:  
[1516605.708046] BPF: Invalid name
[1516605.708047] BPF: 
[1516605.708049] failed to validate module [st] BTF: -22
