[1058336.797543] nvme nvme0: 16/0/0 default/read/poll queues
[1058336.805425] nvme nvme0: Ignoring bogus Namespace Identifiers
[1058337.168352] usb 1-2: reset high-speed USB device number 2 using xhci_hcd
[1058337.506111] psmouse serio1: synaptics: queried max coordinates: x [..5678], y [..4694]
[1058337.540469] psmouse serio1: synaptics: queried min coordinates: x [1266..], y [1162..]
[1058339.701935] OOM killer enabled.
[1058339.701940] Restarting tasks ... 
[1058339.702123] usb 5-4: USB disconnect, device number 44
[1058339.712980] done.
[1058339.713008] random: crng reseeded on system resumption
[1058339.714332] PM: suspend exit
[1058340.764058] Generic FE-GE Realtek PHY r8169-0-200:00: attached PHY driver (mii_bus:phy_addr=r8169-0-200:00, irq=MAC)
[1058340.887862] r8169 0000:02:00.0 enp2s0f0: Link is Down
[1058340.916011] Generic FE-GE Realtek PHY r8169-0-500:00: attached PHY driver (mii_bus:phy_addr=r8169-0-500:00, irq=MAC)
[1058341.103997] r8169 0000:05:00.0 enp5s0: Link is Down
[1058341.463781] usb 5-4: new full-speed USB device number 45 using xhci_hcd
[1058341.625971] usb 5-4: New USB device found, idVendor=0bda, idProduct=4852, bcdDevice= 0.00
[1058341.625984] usb 5-4: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1058341.625988] usb 5-4: Product: Bluetooth Radio
[1058341.625991] usb 5-4: Manufacturer: Realtek
[1058341.625993] usb 5-4: SerialNumber: ...

[1576310.148681] input: Generic USB Audio Consumer Control as /devices/pci0000:00/0000:00:08.1/0000:07:00.3/usb3/3-1/3-1.2/3-1.2:1.3/0003:03F0:056B.0066/input/input232
[1576310.212154] input: Generic USB Audio as /devices/pci0000:00/0000:00:08.1/0000:07:00.3/usb3/3-1/3-1.2/3-1.2:1.3/0003:03F0:056B.0066/input/input233
[1576310.212361] hid-generic 0003:03F0:056B.0066: input,hiddev0,hidraw0: USB HID v1.11 Device [Generic USB Audio] on usb-0000:07:00.3-1.2/input3
[1576310.299929] usb 3-1.3: new high-speed USB device number 87 using xhci_hcd
[1576310.402873] usb 3-1.3: New USB device found, idVendor=03f0, idProduct=086b, bcdDevice= 1.21
[1576310.402888] usb 3-1.3: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576310.402895] usb 3-1.3: Product: USB2734
[1576310.402899] usb 3-1.3: Manufacturer: Microchip Tech
[1576310.451003] hub 3-1.3:1.0: USB hub found
[1576310.451247] hub 3-1.3:1.0: 4 ports detected
[1576310.484531] usb 4-1.3.3: new SuperSpeed USB device number 121 using xhci_hcd
[1576310.521879] usb 4-1.3.3: New USB device found, idVendor=0bda, idProduct=0411, bcdDevice= 1.50
[1576310.521895] usb 4-1.3.3: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576310.521901] usb 4-1.3.3: Product: 2-Port USB 3.0 Hub
[1576310.521905] usb 4-1.3.3: Manufacturer: Generic
[1576310.550485] hub 4-1.3.3:1.0: USB hub found
[1576310.551975] hub 4-1.3.3:1.0: 4 ports detected
[1576310.595931] usb 3-1.5: new full-speed USB device number 88 using xhci_hcd
[1576310.736748] usb 3-1.5: New USB device found, idVendor=03f0, idProduct=046b, bcdDevice= 0.00
[1576310.736757] usb 3-1.5: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576310.736760] usb 3-1.5: Product: HP USB-C Dock G5
[1576310.736762] usb 3-1.5: Manufacturer: HP
[1576310.736764] usb 3-1.5: SerialNumber: ...
[1576310.804494] usb 4-1.3.4: new SuperSpeed USB device number 122 using xhci_hcd
[1576310.848414] usb 4-1.3.4: New USB device found, idVendor=0bda, idProduct=0411, bcdDevice= 1.40
[1576310.848429] usb 4-1.3.4: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576310.848434] usb 4-1.3.4: Product: USB3.2 Hub
[1576310.848438] usb 4-1.3.4: Manufacturer: Generic
[1576310.864810] [drm] Send DSC enable to synaptics
[1576310.867852] hub 4-1.3.4:1.0: USB hub found
[1576310.869276] input: HP HP USB-C Dock G5 System Control as /devices/pci0000:00/0000:00:08.1/0000:07:00.3/usb3/3-1/3-1.5/3-1.5:1.2/0003:03F0:046B.0067/input/input236
[1576310.869925] hub 4-1.3.4:1.0: 3 ports detected
[1576310.919913] usb 3-1.3.3: new high-speed USB device number 89 using xhci_hcd
[1576310.932037] hid-generic 0003:03F0:046B.0067: input,hiddev1,hidraw1: USB HID v1.11 Device [HP HP USB-C Dock G5] on usb-0000:07:00.3-1.5/input2
[1576311.035492] usb 3-1.3.3: New USB device found, idVendor=0bda, idProduct=5411, bcdDevice= 1.50
[1576311.035501] usb 3-1.3.3: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576311.035503] usb 3-1.3.3: Product: 4-Port USB 2.0 Hub
[1576311.035506] usb 3-1.3.3: Manufacturer: Generic
[1576311.091734] hub 3-1.3.3:1.0: USB hub found
[1576311.093133] hub 3-1.3.3:1.0: 4 ports detected
[1576311.303940] usb 3-1.3.4: new high-speed USB device number 90 using xhci_hcd
[1576311.440124] usb 3-1.3.4: New USB device found, idVendor=0bda, idProduct=5411, bcdDevice= 1.40
[1576311.440132] usb 3-1.3.4: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576311.440135] usb 3-1.3.4: Product: USB2.1 Hub
[1576311.440137] usb 3-1.3.4: Manufacturer: Generic
[1576311.924181] hub 3-1.3.4:1.0: USB hub found
[1576311.926122] hub 3-1.3.4:1.0: 4 ports detected
[1576313.536002] usb 4-1.4: new SuperSpeed USB device number 123 using xhci_hcd
[1576313.556388] usb 4-1.4: New USB device found, idVendor=0bda, idProduct=8153, bcdDevice=30.01
[1576313.556393] usb 4-1.4: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[1576313.556395] usb 4-1.4: Product: USB 10/100/1000 LAN
[1576313.556397] usb 4-1.4: Manufacturer: Realtek
[1576313.556398] usb 4-1.4: SerialNumber: ...
[1576313.714994] usb 4-1.4: reset SuperSpeed USB device number 123 using xhci_hcd
[1576313.766566] r8152 4-1.4:1.0: load rtl8153a-3 v2 02/07/20 successfully
[1576313.795086] r8152 4-1.4:1.0 eth0: v1.12.13
[1576313.847288] r8152 4-1.4:1.0 enx843a5b08009f: renamed from eth0
[1576316.643547] IPv6: ADDRCONF(NETDEV_CHANGE): enx843a5b08009f: link becomes ready
[1576316.643855] r8152 4-1.4:1.0 enx843a5b08009f: carrier on
[1576318.023927] [drm:dc_dmub_srv_wait_idle [amdgpu]] *ERROR* Error waiting for DMUB idle: status=3
[1576318.814336] [drm] Send DSC enable to synaptics
[1576319.108745] [drm] Send DSC disable to synaptics
[1576321.451682] [drm] Send DSC enable to synaptics
[1577703.222065] Bluetooth: hci0: AOSP extensions version v1.00
[1577703.222071] Bluetooth: hci0: AOSP quality report is supported
[1577703.302096] Bluetooth: hci0: Bad flag given (0x1) vs supported (0x0)
[1577704.350637] systemd[1]: systemd 249.11-0ubuntu3.6pop0~1674074077~22.04~d0333cb running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT +GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[1577704.350700] systemd[1]: Detected architecture x86-64.
[1577704.652027] systemd-journald[1225108]: Received SIGTERM from PID 1 (systemd).
[1577704.652132] systemd[1]: Stopping Journal Service...
[1577704.655478] systemd[1]: resolvconf-pull-resolved.service: Deactivated successfully.
[1577704.655789] systemd[1]: Finished resolvconf-pull-resolved.service.
[1577704.665383] systemd[1]: systemd-journald.service: Deactivated successfully.
[1577704.665777] systemd[1]: Stopped Journal Service.
[1577704.665815] systemd[1]: systemd-journald.service: Consumed 4min 9.859s CPU time.
[1577704.668092] systemd[1]: Starting Journal Service...
[1577704.701343] systemd[1]: Started Journal Service.
[1577723.936423] BPF: 	 type_id=2023 bits_offset=0
[1577723.936428] BPF:  
[1577723.936431] BPF: Invalid name
[1577723.936433] BPF: 
[1577723.936435] failed to validate module [cpuid] BTF: -22
[1577746.638089] pci 0000:02:00.1: [10ec:816a] type 00 class 0x070002
[1577746.638115] pci 0000:02:00.1: reg 0x10: [io  0x0000-0x00ff]
[1577746.638139] pci 0000:02:00.1: reg 0x18: [mem 0x00000000-0x00000fff 64bit]
[1577746.638155] pci 0000:02:00.1: reg 0x20: [mem 0x00000000-0x00003fff 64bit]
[1577746.638290] pci 0000:02:00.1: supports D1 D2
[1577746.638292] pci 0000:02:00.1: PME# supported from D0 D1 D2 D3hot D3cold
[1577746.638448] pci 0000:02:00.1: Adding to iommu group 13
[1577746.638530] pci 0000:02:00.2: [10ec:816b] type 00 class 0x070002
[1577746.638552] pci 0000:02:00.2: reg 0x10: [io  0x0000-0x00ff]
[1577746.638575] pci 0000:02:00.2: reg 0x18: [mem 0x00000000-0x00000fff 64bit]
[1577746.638589] pci 0000:02:00.2: reg 0x20: [mem 0x00000000-0x00003fff 64bit]
[1577746.638687] pci 0000:02:00.2: supports D1 D2
[1577746.638689] pci 0000:02:00.2: PME# supported from D0 D1 D2 D3hot D3cold
[1577746.638805] pci 0000:02:00.2: Adding to iommu group 13
[1577746.638851] pci 0000:02:00.3: [10ec:816c] type 00 class 0x0c0701
[1577746.638870] pci 0000:02:00.3: reg 0x10: [io  0x0000-0x00ff]
[1577746.638892] pci 0000:02:00.3: reg 0x18: [mem 0x00000000-0x00000fff 64bit]
[1577746.638906] pci 0000:02:00.3: reg 0x20: [mem 0x00000000-0x00003fff 64bit]
[1577746.639002] pci 0000:02:00.3: supports D1 D2
[1577746.639004] pci 0000:02:00.3: PME# supported from D0 D1 D2 D3hot D3cold
[1577746.639112] pci 0000:02:00.3: Adding to iommu group 13
[1577746.639156] pci 0000:02:00.4: [10ec:816d] type 00 class 0x0c0320
[1577746.639176] pci 0000:02:00.4: reg 0x10: [mem 0x00000000-0x00000fff]
[1577746.639197] pci 0000:02:00.4: reg 0x18: [mem 0x00000000-0x00003fff 64bit]
[1577746.639310] pci 0000:02:00.4: supports D1 D2
[1577746.639311] pci 0000:02:00.4: PME# supported from D0 D1 D2 D3hot D3cold
[1577746.639522] pci 0000:02:00.4: Adding to iommu group 13
[1577746.639657] pci 0000:02:00.1: BAR 4: assigned [mem 0xfd808000-0xfd80bfff 64bit]
[1577746.639673] pci 0000:02:00.2: BAR 4: assigned [mem 0xfd80c000-0xfd80ffff 64bit]
[1577746.639686] pci 0000:02:00.3: BAR 4: assigned [mem 0xfd810000-0xfd813fff 64bit]
[1577746.639698] pci 0000:02:00.4: BAR 2: assigned [mem 0xfd814000-0xfd817fff 64bit]
[1577746.639711] pci 0000:02:00.1: BAR 2: assigned [mem 0xfd805000-0xfd805fff 64bit]
[1577746.639724] pci 0000:02:00.2: BAR 2: assigned [mem 0xfd806000-0xfd806fff 64bit]
[1577746.639736] pci 0000:02:00.3: BAR 2: assigned [mem 0xfd807000-0xfd807fff 64bit]
[1577746.639748] pci 0000:02:00.4: BAR 0: assigned [mem 0xfd818000-0xfd818fff]
[1577746.639754] pci 0000:02:00.1: BAR 0: assigned [io  0x4400-0x44ff]
[1577746.639759] pci 0000:02:00.2: BAR 0: assigned [io  0x4800-0x48ff]
[1577746.639764] pci 0000:02:00.3: BAR 0: assigned [io  0x4c00-0x4cff]
[1577746.639810] serial 0000:02:00.1: enabling device (0000 -> 0003)
[1577746.660651] 0000:02:00.1: ttyS4 at I/O 0x4400 (irq = 106, base_baud = 115200) is a 16550A
[1577746.660892] serial 0000:02:00.2: enabling device (0000 -> 0003)
[1577746.661134] BPF: 	 type_id=9 bits_offset=64
[1577746.661138] BPF:  
[1577746.661140] BPF: Invalid name
[1577746.661141] BPF: 
[1577746.661143] failed to validate module [ipmi_si] BTF: -22
[1577746.681627] 0000:02:00.2: ttyS5 at I/O 0x4800 (irq = 46, base_baud = 115200) is a 16550A
[1577746.681929] pci 0000:02:00.4: enabling device (0000 -> 0002)
[1577746.682404] ehci-pci 0000:02:00.4: EHCI Host Controller
[1577746.682409] ehci-pci 0000:02:00.4: new USB bus registered, assigned bus number 7
[1577746.682468] ehci-pci 0000:02:00.4: irq 108, io mem 0xfd818000
[1577746.700267] ehci-pci 0000:02:00.4: USB 0.0 started, EHCI 1.00
[1577746.700338] usb usb7: New USB device found, idVendor=1d6b, idProduct=0002, bcdDevice= 6.00
[1577746.700343] usb usb7: New USB device strings: Mfr=3, Product=2, SerialNumber=...
[1577746.700345] usb usb7: Product: EHCI Host Controller
[1577746.700347] usb usb7: Manufacturer: Linux 6.0.12-76060006-generic ehci_hcd
[1577746.700349] usb usb7: SerialNumber: ...
[1577746.700504] hub 7-0:1.0: USB hub found
[1577746.700512] hub 7-0:1.0: 1 port detected
[1579277.881860] [drm:dc_dmub_srv_wait_idle [amdgpu]] *ERROR* Error waiting for DMUB idle: status=3
[1579278.646500] [drm] Send DSC enable to synaptics
[1579278.940408] [drm] Send DSC disable to synaptics
[1579814.635118] [drm] Send DSC enable to synaptics
[1581878.561024] [drm:dc_dmub_srv_wait_idle [amdgpu]] *ERROR* Error waiting for DMUB idle: status=3
[1581879.341113] [drm] Send DSC enable to synaptics
[1581879.635604] [drm] Send DSC disable to synaptics
[1582250.113342] [drm] Send DSC enable to synaptics
[1583897.359336] mmc0: error -123 whilst initialising SD card
[1583898.911086] mmc0: error -123 whilst initialising SD card
[1583899.692754] mmc0: error -123 whilst initialising SD card
[1583916.794415] mmc0: cannot verify signal voltage switch
[1583916.913612] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1583916.928021] BPF: 	 type_id=2023 bits_offset=0
[1583916.928027] BPF:  
[1583916.928029] BPF: Invalid name
[1583916.928030] BPF: 
[1583916.928032] failed to validate module [mmc_block] BTF: -22
[1583917.257204] mmc0: card aaaa removed
[1583918.360181] mmc0: cannot verify signal voltage switch
[1583918.464326] mmc0: error -123 whilst initialising SD card
[1583919.756157] mmc0: cannot verify signal voltage switch
[1583919.878472] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1583919.882841] BPF: 	 type_id=2023 bits_offset=0
[1583919.882849] BPF:  
[1583919.882852] BPF: Invalid name
[1583919.882855] BPF: 
[1583919.882860] failed to validate module [mmc_block] BTF: -22
[1584928.162350] mmc0: card aaaa removed
[1584978.214982] mmc0: error -123 whilst initialising SD card
[1584980.094564] mmc0: cannot verify signal voltage switch
[1584980.215816] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1584980.219593] BPF: 	 type_id=2023 bits_offset=0
[1584980.219596] BPF:  
[1584980.219597] BPF: Invalid name
[1584980.219598] BPF: 
[1584980.219600] failed to validate module [mmc_block] BTF: -22
[1584980.814290] mmc0: card aaaa removed
[1584983.182450] mmc0: cannot verify signal voltage switch
[1584983.303621] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1584983.307091] BPF: 	 type_id=2023 bits_offset=0
[1584983.307101] BPF:  
[1584983.307104] BPF: Invalid name
[1584983.307106] BPF: 
[1584983.307110] failed to validate module [mmc_block] BTF: -22
[1584983.553378] mmc0: card aaaa removed
[1584986.933453] mmc0: error -123 whilst initialising SD card
[1584988.174457] mmc0: cannot verify signal voltage switch
[1584988.299686] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1584988.305436] BPF: 	 type_id=2023 bits_offset=0
[1584988.305442] BPF:  
[1584988.305445] BPF: Invalid name
[1584988.305447] BPF: 
[1584988.305451] failed to validate module [mmc_block] BTF: -22
[1585135.350051] mmc0: card aaaa removed
[1585145.812030] mmc0: cannot verify signal voltage switch
[1585145.914585] mmc0: error -123 whilst initialising SD card
[1585148.161654] mmc0: cannot verify signal voltage switch
[1585148.283671] mmc0: new ultra high speed SDR104 SDXC card at address aaaa
[1585148.288509] BPF: 	 type_id=2023 bits_offset=0
[1585148.288514] BPF:  
[1585148.288516] BPF: Invalid name
[1585148.288517] BPF: 
[1585148.288518] failed to validate module [mmc_block] BTF: -22
[1585469.210581] mmc0: card aaaa removed
[1585932.671619] BPF: 	 type_id=2023 bits_offset=0
[1585932.671625] BPF:  
[1585932.671628] BPF: Invalid name
[1585932.671629] BPF: 
[1585932.671632] failed to validate module [st] BTF: -22
