[    0.000000] Linux version 6.1.8-1-default (XXX@XXX) (gcc (SUSE Linux) 12.2.1 20221020 [revision 0aaef83351473e8f4eb774f8f999bbe87a4866d7], GNU ld (GNU Binutils; openSUSE Tumbleweed) XXX.XXX.XXX.XXX-2) #1 SMP PREEMPT_DYNAMIC Tue Jan 24 06:29:25 UTC 2023 (baebfe0)
[    0.000000] Command line: BOOT_IMAGE=/boot/vmlinuz-6.1.8-1-default root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX splash=silent mitigations=auto quiet security=apparmor
[    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x008: 'MPX bounds registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x010: 'MPX CSR'
[    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
[    0.000000] x86/fpu: xstate_offset[3]:  832, xstate_sizes[3]:   64
[    0.000000] x86/fpu: xstate_offset[4]:  896, xstate_sizes[4]:   64
[    0.000000] x86/fpu: Enabled xstate features 0x1f, context size is 960 bytes, using 'compacted' format.
[    0.000000] signal: max sigframe size: 2032
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000009efff] usable
[    0.000000] BIOS-e820: [mem 0x000000000009f000-0x00000000000fffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x0000000092678fff] usable

[    5.334593] ACPI: button: Sleep Button [SLPB]
[    5.334621] input: Power Button as /devices/LNXSYSTM:00/LNXSYBUS:00/PNP0C0C:00/input/input20
[    5.334650] ACPI: button: Power Button [PWRB]
[    5.334676] input: Power Button as /devices/LNXSYSTM:00/LNXPWRBN:00/input/input21
[    5.352259] ACPI: button: Power Button [PWRF]
[    5.358922] Adding 2097148k swap on /dev/nvme0n1p6.  Priority:-2 extents:1 across:2097148k SSFS
[    5.414658] thermal LNXTHERM:00: registered as thermal_zone0
[    5.414665] ACPI: thermal: Thermal Zone [HEPZ] (30 C)
[    5.545440] intel_pch_thermal 0000:00:12.0: enabling device (0100 -> 0102)
[    5.545819] EDAC ie31200: No ECC support
[    5.556399] i801_smbus 0000:00:1f.4: enabling device (0100 -> 0103)
[    5.556896] i801_smbus 0000:00:1f.4: SPD Write Disable is set
[    5.556992] i801_smbus 0000:00:1f.4: SMBus using PCI interrupt
[    5.560501] i2c i2c-7: 1/2 memory slots populated (from DMI)
[    5.561015] i2c i2c-7: Successfully instantiated SPD at 0x50
[    5.571465] mei_me 0000:00:16.0: enabling device (0000 -> 0002)
[    5.682855] input: PC Speaker as /devices/platform/pcspkr/input/input22
[    5.700031] e1000e: Intel(R) PRO/1000 Network Driver
[    5.700037] e1000e: Copyright(c) 1999 - 2015 Intel Corporation.
[    5.700847] e1000e 0000:00:1f.6: Interrupt Throttling Rate (ints/sec) set to dynamic conservative mode
[    5.784092] e1000e 0000:00:1f.6 0000:00:1f.6 (uninitialized): registered PHC clock
[    5.788077] hp_wmi: query 0x4 returned error 0x5
[    5.793063] input: HP WMI hotkeys as /devices/virtual/input/input23
[    5.856378] e1000e 0000:00:1f.6 eth0: (PCI Express:2.5GT/s:Width x1) XX:XX:XX:XX:XX:XX
[    5.856381] e1000e 0000:00:1f.6 eth0: Intel(R) PRO/1000 Network Connection
[    5.856524] e1000e 0000:00:1f.6 eth0: MAC: 13, PHY: 12, PBA No: FFFFFF-0FF
[    5.969626] snd_hda_intel 0000:00:1f.3: dmic_detect option is deprecated, pass snd-intel-dspcfg.dsp_driver=1 option instead
[    5.969656] snd_hda_intel 0000:00:1f.3: enabling device (0100 -> 0102)
[    5.969962] snd_hda_intel 0000:00:1f.3: bound 0000:00:02.0 (ops i915_audio_component_bind_ops [i915])
[    6.045193] iTCO_vendor_support: vendor-support=0
[    6.045923] ee1004 7-0050: 512 byte EE1004-compliant SPD EEPROM, read-only
[    6.075777] mei_hdcp 0000:00:16.0-XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX: bound 0000:00:02.0 (ops i915_hdcp_component_ops [i915])
[    6.104342] e1000e 0000:00:1f.6 eno1: renamed from eth0
[    6.105324] spi-nor spi0.0: w25q256 (32768 Kbytes)
[    6.120146] Creating 1 MTD partitions on "0000:00:1f.5":
[    6.120152] 0x000000000000-0x000002000000 : "BIOS"
[    6.145338] iTCO_wdt iTCO_wdt: Found a Intel PCH TCO device (Version=6, TCOBASE=0x0400)
[    6.145498] iTCO_wdt iTCO_wdt: initialized. heartbeat=30 sec (nowayout=0)
[    6.208095] snd_hda_codec_conexant hdaudioC0D0: CX20632: BIOS auto-probing.
[    6.209362] snd_hda_codec_conexant hdaudioC0D0: autoconfig for CX20632: line_outs=2 (0x19/0x1c/0x0/0x0/0x0) type:hp
[    6.209367] snd_hda_codec_conexant hdaudioC0D0:    speaker_outs=1 (0x1f/0x0/0x0/0x0/0x0)
[    6.209370] snd_hda_codec_conexant hdaudioC0D0:    hp_outs=0 (0x0/0x0/0x0/0x0/0x0)
[    6.209373] snd_hda_codec_conexant hdaudioC0D0:    mono: mono_out=0x0
[    6.209375] snd_hda_codec_conexant hdaudioC0D0:    inputs:
[    6.209376] snd_hda_codec_conexant hdaudioC0D0:      Mic=0x1a
[    6.216584] intel_tcc_cooling: Programmable TCC Offset detected
[    6.248953] systemd-journald[526]: Received client request to flush runtime journal.
[    6.290561] input: HDA Digital PCBeep as /devices/pci0000:00/0000:00:1f.3/sound/card0/input24
[    6.290612] input: HDA Intel PCH Mic as /devices/pci0000:00/0000:00:1f.3/sound/card0/input25
[    6.290640] input: HDA Intel PCH Front Headphone Front as /devices/pci0000:00/0000:00:1f.3/sound/card0/input26
[    6.290668] input: HDA Intel PCH Front Headphone Surround as /devices/pci0000:00/0000:00:1f.3/sound/card0/input27
[    6.414363] intel_pmc_core intel_pmc_core.0:  initialized
[    6.434678] intel_rapl_common: Found RAPL domain package
[    6.434681] intel_rapl_common: Found RAPL domain core
[    6.434682] intel_rapl_common: Found RAPL domain uncore
[    6.434683] intel_rapl_common: Found RAPL domain dram
[    6.434683] intel_rapl_common: Found RAPL domain psys
[    6.613239] NET: Registered PF_QIPCRTR protocol family
[    6.769086] bpfilter: Loaded bpfilter_umh pid 878
[    6.769338] Started bpfilter
[    9.959061] e1000e 0000:00:1f.6 eno1: NIC Link is Up 1000 Mbps Full Duplex, Flow Control: Rx/Tx
[    9.959184] IPv6: ADDRCONF(NETDEV_CHANGE): eno1: link becomes ready
[    9.983066] NET: Registered PF_PACKET protocol family
[   12.873479] logitech-hidpp-device 0003:046D:407B.0007: HID++ 4.5 device connected.
[  243.904039] systemd[1]: systemd 252.5+suse.46.gd87834a334 running in system mode (+PAM +AUDIT +SELINUX +APPARMOR -IMA -SMACK +SECCOMP +GCRYPT +GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 +PWQUALITY +P11KIT +QRENCODE +TPM2 +BZIP2 +LZ4 +XZ +ZLIB +ZSTD +BPF_FRAMEWORK -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[  243.904468] systemd[1]: Detected architecture x86-64.
[  243.976504] systemd[1]: bpf-lsm: BPF LSM hook not enabled in the kernel, BPF LSM not supported
[  244.024027] systemd[1]: /usr/lib/systemd/system/plymouth-start.service:15: Unit uses KillMode=none. This is unsafe, as it disables systemd's process lifecycle management for the service. Please update the service to use a safer KillMode=, such as 'mixed' or 'control-group'. Support for KillMode=none is deprecated and will eventually be removed.
[  244.469743] systemd-journald[526]: Received SIGTERM from PID 1 (systemd).
[  244.469824] systemd[1]: Stopping Journal Service...
[  244.476788] systemd[1]: systemd-journald.service: Deactivated successfully.
[  244.476882] systemd[1]: Stopped Journal Service.
[  244.503466] systemd[1]: Starting Journal Service...
[  244.519098] systemd[1]: Started Journal Service.
[  298.803982] BPF: 	 type_id=355 bits_offset=8192
[  298.803987] BPF:  
[  298.803988] BPF: Invalid name
[  298.803990] BPF: 
[  298.803991] failed to validate module [af_alg] BTF: -22
[  298.804038] NET: Registered PF_ALG protocol family
[  298.807765] BPF: 	 type_id=355 bits_offset=8192
[  298.807772] BPF:  
[  298.807774] BPF: Invalid name
[  298.807793] BPF: 
[  298.807795] failed to validate module [algif_hash] BTF: -22
[  609.495074] BTRFS info (device nvme0n1p5): qgroup scan completed (inconsistency flag cleared)
[ 2163.005879] BPF: 	 type_id=60 bits_offset=0
[ 2163.005882] BPF:  
[ 2163.005883] BPF: Invalid name
[ 2163.005884] BPF: 
[ 2163.005886] failed to validate module [parport] BTF: -22
[ 2163.011634] BPF: 	 type_id=60 bits_offset=0
[ 2163.011638] BPF:  
[ 2163.011639] BPF: Invalid name
[ 2163.011641] BPF: 
[ 2163.011642] failed to validate module [parport_pc] BTF: -22
[ 2163.016987] BPF: 	 type_id=60 bits_offset=0
[ 2163.016991] BPF:  
[ 2163.016992] BPF: Invalid name
[ 2163.016994] BPF: 
[ 2163.016995] failed to validate module [ppdev] BTF: -22
[ 2163.017167] BPF: 	 type_id=60 bits_offset=0
[ 2163.017170] BPF:  
[ 2163.017172] BPF: Invalid name
[ 2163.017173] BPF: 
[ 2163.017174] failed to validate module [lp] BTF: -22
[ 2163.018883] ppdev: user-space parallel port driver
[ 2163.019005] lp: driver loaded but no devices found
[ 2163.242836] BPF: 	 type_id=60 bits_offset=0
[ 2163.242847] BPF:  
[ 2163.242851] BPF: Invalid name
[ 2163.242855] BPF: 
[ 2163.242859] failed to validate module [parport_pc] BTF: -22
[ 2163.259273] BPF: 	 type_id=60 bits_offset=0
[ 2163.259277] BPF:  
[ 2163.259278] BPF: Invalid name
[ 2163.259279] BPF: 
[ 2163.259281] failed to validate module [lp] BTF: -22
[ 2163.261001] lp: driver loaded but no devices found
[ 2163.272975] BPF: 	 type_id=64 bits_offset=0
[ 2163.272979] BPF:  
[ 2163.272980] BPF: Invalid name
[ 2163.272981] BPF: 
[ 2163.272982] failed to validate module [cdrom] BTF: -22
[ 2163.274135] BPF: 	72 type_id=64 bitfield_size=1 bits_offset=9
[ 2163.274151] BPF:  
[ 2163.274152] BPF: Invalid name
[ 2163.274153] BPF: 
[ 2163.274154] failed to validate module [sr_mod] BTF: -22
[ 2163.283557] BPF: [112210] STRUCT  
[ 2163.283561] BPF: size=8 vlen=2
[ 2163.283562] BPF:  
[ 2163.283563] BPF: Invalid name
[ 2163.283564] BPF: 
[ 2163.283566] failed to validate module [st] BTF: -22
[ 2163.283604] st: Version 20160209, fixed bufsize 32768, s/g segs 256
[ 2163.315640] BPF: [112210] STRUCT  
[ 2163.315645] BPF: size=80 vlen=4
[ 2163.315647] BPF:  
[ 2163.315648] BPF: Invalid name
[ 2163.315650] BPF: 
[ 2163.315651] failed to validate module [edd] BTF: -22
[ 2345.575290] BPF: [112210] STRUCT  
[ 2345.575294] BPF: size=80 vlen=4
[ 2345.575296] BPF:  
[ 2345.575297] BPF: Invalid name
[ 2345.575297] BPF: 
[ 2345.575299] failed to validate module [edd] BTF: -22
