[    0.000000] microcode: microcode updated early to revision 0x60f, date = 2010-09-29
[    0.000000] Linux version 6.0.12-76060006-generic (XXX@XXX) (x86_64-linux-gnu-gcc-11 (Ubuntu 11.2.0-19ubuntu1) 11.2.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #202212290932~1671652965~22.04~452ea9d SMP PREEMPT_DYNAMIC Wed D
[    0.000000] Command line: initrd=\EFI\Pop_OS-XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX\initrd.img root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX ro quiet loglevel=7 systemd.show_status=false user_debug=31 selinux=1 processor.nocst
[    0.000000] KERNEL supported cpus:
[    0.000000]   Intel GenuineIntel
[    0.000000]   AMD AuthenticAMD
[    0.000000]   Hygon HygonGenuine
[    0.000000]   Centaur CentaurHauls
[    0.000000]   zhaoxin   Shanghai  
[    0.000000] x86/fpu: x87 FPU will use FXSAVE
[    0.000000] signal: max sigframe size: 1440
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000008efff] usable
[    0.000000] BIOS-e820: [mem 0x000000000008f000-0x000000000008ffff] ACPI NVS
[    0.000000] BIOS-e820: [mem 0x0000000000090000-0x000000000009ffff] usable
[    0.000000] BIOS-e820: [mem 0x00000000000a0000-0x00000000000bffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x00000000be833fff] usable
[    0.000000] BIOS-e820: [mem 0x00000000be834000-0x00000000be839fff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000be83a000-0x00000000be846fff] usable

[   23.114363] at24 0-0050: 256 byte spd EEPROM, read-only
[   23.522560] usbcore: registered new device driver apple-mfi-fastcharge
[   23.737290] pstore: Using crash dump compression: deflate
[   23.803626] pstore: Registered efi as persistent store backend
[   24.152859] mc: Linux media interface: v0.10
[   24.992306] applesmc: key=224 fan=3 temp=13 index=13 acc=1 lux=2 kbd=0
[   24.994539] input: applesmc as /devices/platform/applesmc.768/input/input10
[   24.995054] applesmc applesmc.768: hwmon_device_register() is deprecated. Please convert the driver to use hwmon_device_register_with_info().
[   25.447580] Bluetooth: Core ver 2.22
[   25.447633] NET: Registered PF_BLUETOOTH protocol family
[   25.447635] Bluetooth: HCI device and connection manager initialized
[   25.447832] Bluetooth: HCI socket layer initialized
[   25.447836] Bluetooth: L2CAP socket layer initialized
[   25.447843] Bluetooth: SCO socket layer initialized
[   26.611961] videodev: Linux video capture interface: v2.00
[   26.770570] snd_hda_intel 0000:00:1b.0: enabling device (0000 -> 0002)
[   26.943970] cfg80211: Loading compiled-in X.509 certificates for regulatory database
[   26.945501] cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
[   27.422703] snd_hda_codec_realtek hdaudioC0D0: ALC889A: SKU not ready 0x400000f0
[   27.424789] usbcore: registered new interface driver btusb
[   27.425948] snd_hda_codec_realtek hdaudioC0D0: autoconfig for ALC889A: line_outs=2 (0x14/0x16/0x0/0x0/0x0) type:speaker
[   27.425953] snd_hda_codec_realtek hdaudioC0D0:    speaker_outs=0 (0x0/0x0/0x0/0x0/0x0)
[   27.425956] snd_hda_codec_realtek hdaudioC0D0:    hp_outs=1 (0x15/0x0/0x0/0x0/0x0)
[   27.425959] snd_hda_codec_realtek hdaudioC0D0:    mono: mono_out=0x0
[   27.425961] snd_hda_codec_realtek hdaudioC0D0:    dig-out=0x1e/0x0
[   27.425962] snd_hda_codec_realtek hdaudioC0D0:    inputs:
[   27.425964] snd_hda_codec_realtek hdaudioC0D0:      Mic=0x18
[   27.425967] snd_hda_codec_realtek hdaudioC0D0:      Line=0x1a
[   27.425968] snd_hda_codec_realtek hdaudioC0D0:    dig-in=0x1f
[   27.450080] input: HDA Intel Line as /devices/pci0000:00/0000:00:1b.0/sound/card0/input11
[   27.450159] input: HDA Intel Headphone as /devices/pci0000:00/0000:00:1b.0/sound/card0/input12
[   27.484902] usb 3-1.2: USB disconnect, device number 5
[   27.754909] usb 3-1.3: USB disconnect, device number 6
[   29.110795] usb 2-4: Found UVC 1.00 device Built-in iSight (05ac:8502)
[   29.122956] input: Built-in iSight as /devices/pci0000:00/0000:00:1d.7/usb2/2-4/2-4:1.0/input/input13
[   29.124323] usbcore: registered new interface driver uvcvideo
[   29.628315] intel_powerclamp: No package C-state available
[   29.656640] intel_powerclamp: No package C-state available
[   33.094491] cryptd: max_cpu_qlen set to 1000
[   36.034469] b43-phy0: Broadcom 4321 WLAN found (core revision 12)
[   36.076429] b43-phy0: Found PHY: Analog 5, Type 4 (N), Revision 2
[   36.076458] b43-phy0: Found Radio: Manuf 0x17F, ID 0x2055, Revision 4, Version 0
[   36.092581] b43 ssb0:0: Direct firmware load for b43/ucode11.fw failed with error -2
[   36.092630] b43 ssb0:0: Direct firmware load for b43/ucode11.fw failed with error -2
[   36.092686] b43 ssb0:0: Direct firmware load for b43-open/ucode11.fw failed with error -2
[   36.092731] b43 ssb0:0: Direct firmware load for b43-open/ucode11.fw failed with error -2
[   36.092736] b43-phy0 ERROR: Firmware file "b43/ucode11.fw" not found
[   36.094626] b43-phy0 ERROR: Firmware file "b43-open/ucode11.fw" not found
[   36.096509] b43-phy0 ERROR: You must go to https://wireless.wiki.kernel.org/en/users/Drivers/b43#devicefirmware and download the correct firmware for this driver version. Please carefully read all instructions on this website.
[   36.098594] Broadcom 43xx driver loaded [ Features: PNL ]
[   40.109767] Adding 4193784k swap on /dev/mapper/XXXXXXXXXX  Priority:-2 extents:1 across:4193784k FS
[   45.154593] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[   45.154607] Bluetooth: BNEP filters: protocol multicast
[   45.154621] Bluetooth: BNEP socket layer initialized
[   45.159737] Bluetooth: MGMT ver 1.22
[   46.093346] pci 0000:00:1e.0: PCI bridge to [bus 06]
[   46.093357] pci 0000:00:1e.0:   bridge window [mem 0xd0000000-0xd00fffff]
[   46.433086] NET: Registered PF_ALG protocol family
[   55.951715] sky2 0000:05:00.0 ens5: enabling interface
[   56.629147] Dynamic Preempt: full
[   57.299517] Dynamic Preempt: full
[   69.077431] sky2 0000:05:00.0 ens5: Link is up at 100 Mbps, full duplex, flow control both
[   69.077481] IPv6: ADDRCONF(NETDEV_CHANGE): ens5: link becomes ready
[   79.705226] Bluetooth: RFCOMM TTY layer initialized
[   79.705251] Bluetooth: RFCOMM socket layer initialized
[   79.705275] Bluetooth: RFCOMM ver 1.11
[  107.972082] rfkill: input handler disabled
[  419.788013] rfkill: input handler enabled
[  429.101372] rfkill: input handler disabled
[ 1530.478590] systemd[1]: systemd 249.11-0ubuntu3.6pop0~1672358811~22.04~1352e5c running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT +GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[ 1530.478783] systemd[1]: Detected architecture x86-64.
[ 1531.217343] systemd-journald[316]: Received SIGTERM from PID 1 (systemd).
[ 1531.218645] systemd[1]: Stopping Journal Service...
[ 1531.222692] systemd[1]: resolvconf-pull-resolved.service: Deactivated successfully.
[ 1531.223128] systemd[1]: Finished resolvconf-pull-resolved.service.
[ 1531.368473] systemd[1]: systemd-journald.service: Deactivated successfully.
[ 1531.368900] systemd[1]: Stopped Journal Service.
[ 1531.368957] systemd[1]: systemd-journald.service: Consumed 1.196s CPU time.
[ 1531.389097] systemd[1]: Starting Journal Service...
[ 1531.420258] systemd[1]: Started Journal Service.
[ 1597.817772] BPF: 	 type_id=3 bits_offset=2208
[ 1597.817779] BPF:  
[ 1597.817781] BPF: Invalid name
[ 1597.817783] BPF: 
[ 1597.817786] failed to validate module [cpuid] BTF: -22
[ 1678.218795] BPF: [124896] STRUCT a..percpu 
[ 1678.218803] BPF: size=16 vlen=3
[ 1678.218806] BPF:  
[ 1678.218807] BPF: Invalid name
[ 1678.218809] BPF: 
[ 1678.218812] failed to validate module [zram] BTF: -22
[ 3817.594115] BPF: 	 type_id=3 bits_offset=2208
[ 3817.594123] BPF:  
[ 3817.594125] BPF: Invalid name
[ 3817.594127] BPF: 
[ 3817.594130] failed to validate module [binfmt_misc] BTF: -22
[ 3817.649561] BPF: 	 type_id=3 bits_offset=2208
[ 3817.649569] BPF:  
[ 3817.649571] BPF: Invalid name
[ 3817.649573] BPF: 
[ 3817.649576] failed to validate module [binfmt_misc] BTF: -22
[ 3817.737849] BPF: 	 type_id=3 bits_offset=2208
[ 3817.737857] BPF:  
[ 3817.737859] BPF: Invalid name
[ 3817.737860] BPF: 
[ 3817.737863] failed to validate module [binfmt_misc] BTF: -22
[ 3819.946453] BPF: 	 type_id=3 bits_offset=2208
[ 3819.946461] BPF:  
[ 3819.946463] BPF: Invalid name
[ 3819.946465] BPF: 
[ 3819.946467] failed to validate module [binfmt_misc] BTF: -22
[ 3819.991239] BPF: 	 type_id=3 bits_offset=2208
[ 3819.991246] BPF:  
[ 3819.991248] BPF: Invalid name
[ 3819.991250] BPF: 
[ 3819.991252] failed to validate module [binfmt_misc] BTF: -22
[ 4198.408665] BPF: 	 type_id=3 bits_offset=2208
[ 4198.408672] BPF:  
[ 4198.408675] BPF: Invalid name
[ 4198.408676] BPF: 
[ 4198.408679] failed to validate module [binfmt_misc] BTF: -22
[ 4198.461566] BPF: 	 type_id=3 bits_offset=2208
[ 4198.461573] BPF:  
[ 4198.461575] BPF: Invalid name
[ 4198.461577] BPF: 
[ 4198.461579] failed to validate module [binfmt_misc] BTF: -22
[ 4199.982668] BPF: 	 type_id=3 bits_offset=2208
[ 4199.982676] BPF:  
[ 4199.982678] BPF: Invalid name
[ 4199.982680] BPF: 
[ 4199.982683] failed to validate module [pktcdvd] BTF: -22
[ 4903.317316] BPF: 	 type_id=3 bits_offset=2208
[ 4903.317324] BPF:  
[ 4903.317326] BPF: Invalid name
[ 4903.317328] BPF: 
[ 4903.317330] failed to validate module [eeprom] BTF: -22
[ 6595.130383] BPF: 	 type_id=3 bits_offset=2208
[ 6595.130392] BPF:  
[ 6595.130394] BPF: Invalid name
[ 6595.130396] BPF: 
[ 6595.130399] failed to validate module [nfnetlink] BTF: -22
[ 6595.171000] BPF: 	 type_id=3 bits_offset=2208
[ 6595.171008] BPF:  
[ 6595.171010] BPF: Invalid name
[ 6595.171012] BPF: 
[ 6595.171016] failed to validate module [nfnetlink] BTF: -22
[ 6595.226448] BPF: 	 type_id=3 bits_offset=2208
[ 6595.226476] BPF:  
[ 6595.226478] BPF: Invalid name
[ 6595.226480] BPF: 
[ 6595.226484] failed to validate module [nfnetlink] BTF: -22
[ 6595.272537] BPF: 	 type_id=3 bits_offset=2208
[ 6595.272545] BPF:  
[ 6595.272547] BPF: Invalid name
[ 6595.272549] BPF: 
[ 6595.272553] failed to validate module [nfnetlink] BTF: -22
[ 6595.314510] BPF: 	 type_id=3 bits_offset=2208
[ 6595.314518] BPF:  
[ 6595.314520] BPF: Invalid name
[ 6595.314522] BPF: 
[ 6595.314526] failed to validate module [nfnetlink] BTF: -22
[ 6595.358198] BPF: 	 type_id=3 bits_offset=2208
[ 6595.358206] BPF:  
[ 6595.358208] BPF: Invalid name
[ 6595.358209] BPF: 
[ 6595.358213] failed to validate module [nfnetlink] BTF: -22
[ 6595.400156] BPF: 	 type_id=3 bits_offset=2208
[ 6595.400163] BPF:  
[ 6595.400165] BPF: Invalid name
[ 6595.400167] BPF: 
[ 6595.400171] failed to validate module [nfnetlink] BTF: -22
[ 6595.443682] BPF: 	 type_id=3 bits_offset=2208
[ 6595.443691] BPF:  
[ 6595.443693] BPF: Invalid name
[ 6595.443694] BPF: 
[ 6595.443698] failed to validate module [nfnetlink] BTF: -22
[ 6595.610575] BPF: 	 type_id=3 bits_offset=2208
[ 6595.610583] BPF:  
[ 6595.610585] BPF: Invalid name
[ 6595.610587] BPF: 
[ 6595.610591] failed to validate module [nfnetlink] BTF: -22
[10642.672333] wl: module license 'MIXED/Proprietary' taints kernel.
[10642.672341] Disabling lock debugging due to kernel taint
[22284.625905] BPF: 	 type_id=3 bits_offset=2208
[22284.625913] BPF:  
[22284.625915] BPF: Invalid name
[22284.625917] BPF: 
[22284.625920] failed to validate module [ipmi_watchdog] BTF: -22
[22295.618675] BPF: 	 type_id=3 bits_offset=2208
[22295.618685] BPF:  
[22295.618689] BPF: Invalid name
[22295.618692] BPF: 
[22295.618695] failed to validate module [ipmi_poweroff] BTF: -22
[22343.926746] BPF: 	 type_id=3 bits_offset=2208
[22343.926753] BPF:  
[22343.926756] BPF: Invalid name
[22343.926758] BPF: 
[22343.926760] failed to validate module [ipmi_ssif] BTF: -22
[22347.569712] BPF: [124896] STRUCT  
[22347.569721] BPF: size=72 vlen=17
[22347.569724] BPF:  
[22347.569726] BPF: Invalid name
[22347.569728] BPF: 
[22347.569731] failed to validate module [ipmi_si] BTF: -22
[22359.726504] BPF: 	 type_id=3 bits_offset=2208
[22359.726512] BPF:  
[22359.726515] BPF: Invalid name
[22359.726517] BPF: 
[22359.726520] failed to validate module [ipmi_ssif] BTF: -22
[22386.100115] BPF: [124896] STRUCT  
[22386.100126] BPF: size=72 vlen=17
[22386.100129] BPF:  
[22386.100132] BPF: Invalid name
[22386.100135] BPF: 
[22386.100140] failed to validate module [i2c_cbus_gpio] BTF: -22
[22406.176826] BPF: 	 type_id=3 bits_offset=2208
[22406.176836] BPF:  
[22406.176839] BPF: Invalid name
[22406.176842] BPF: 
[22406.176847] failed to validate module [i2c_cros_ec_tunnel] BTF: -22
[22457.703314] BPF: 	 type_id=3 bits_offset=2208
[22457.703324] BPF:  
[22457.703328] BPF: Invalid name
[22457.703331] BPF: 
[22457.703335] failed to validate module [i2c_amd_mp2_pci] BTF: -22
[22470.591796] BPF: 	 type_id=3 bits_offset=2208
[22470.591807] BPF:  
[22470.591810] BPF: Invalid name
[22470.591813] BPF: 
[22470.591817] failed to validate module [i2c_amd_mp2_pci] BTF: -22
[23141.164181] BPF: 	 type_id=3 bits_offset=2208
[23141.164190] BPF:  
[23141.164255] BPF: Invalid name
[23141.164258] BPF: 
[23141.164262] failed to validate module [nvram] BTF: -22
[23141.494808] BPF: 	 type_id=3 bits_offset=2208
[23141.494816] BPF:  
[23141.494819] BPF: Invalid name
[23141.494821] BPF: 
[23141.494825] failed to validate module [st] BTF: -22
