[    0.000000] microcode: microcode updated early to revision 0x60f, date = 2010-09-29
[    0.000000] Linux version 6.0.12-76060006-generic (XXX@XXX) (x86_64-linux-gnu-gcc-11 (Ubuntu 11.2.0-19ubuntu1) 11.2.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #202212290932~1671652965~22.04~452ea9d SMP PREEMPT_DYNAMIC Wed D
[    0.000000] Command line: initrd=\EFI\Pop_OS-XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX\initrd.img root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX ro quiet loglevel=0 systemd.show_status=false splash
[    0.000000] KERNEL supported cpus:
[    0.000000]   Intel GenuineIntel
[    0.000000]   AMD AuthenticAMD
[    0.000000]   Hygon HygonGenuine
[    0.000000]   Centaur CentaurHauls
[    0.000000]   zhaoxin   Shanghai  
[    0.000000] x86/fpu: x87 FPU will use FXSAVE
[    0.000000] signal: max sigframe size: 1440
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000008efff] usable
[    0.000000] BIOS-e820: [mem 0x000000000008f000-0x000000000008ffff] ACPI NVS
[    0.000000] BIOS-e820: [mem 0x0000000000090000-0x000000000009ffff] usable
[    0.000000] BIOS-e820: [mem 0x00000000000a0000-0x00000000000bffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x00000000be833fff] usable
[    0.000000] BIOS-e820: [mem 0x00000000be834000-0x00000000be839fff] reserved
[    0.000000] BIOS-e820: [mem 0x00000000be83a000-0x00000000be846fff] usable
[    0.000000] BIOS-e820: [mem 0x00000000be847000-0x00000000be848fff] reserved

[   24.930762] at24 0-0050: supply vcc not found, using dummy regulator
[   24.931382] at24 0-0050: 256 byte spd EEPROM, read-only
[   25.460706] pstore: Using crash dump compression: deflate
[   25.509487] pstore: Registered efi as persistent store backend
[   25.689015] applesmc: key=224 fan=3 temp=13 index=13 acc=1 lux=2 kbd=0
[   25.690069] input: applesmc as /devices/platform/applesmc.768/input/input8
[   25.690167] applesmc applesmc.768: hwmon_device_register() is deprecated. Please convert the driver to use hwmon_device_register_with_info().
[   26.039311] usbcore: registered new device driver apple-mfi-fastcharge
[   26.953213] mc: Linux media interface: v0.10
[   27.885887] videodev: Linux video capture interface: v2.00
[   28.532597] snd_hda_intel 0000:00:1b.0: enabling device (0000 -> 0002)
[   28.815247] Bluetooth: Core ver 2.22
[   28.815283] NET: Registered PF_BLUETOOTH protocol family
[   28.815286] Bluetooth: HCI device and connection manager initialized
[   28.816430] Bluetooth: HCI socket layer initialized
[   28.816436] Bluetooth: L2CAP socket layer initialized
[   28.816449] Bluetooth: SCO socket layer initialized
[   28.912280] usb 2-4: Found UVC 1.00 device Built-in iSight (05ac:8502)
[   28.920655] input: Built-in iSight as /devices/pci0000:00/0000:00:1d.7/usb2/2-4/2-4:1.0/input/input9
[   28.920766] usbcore: registered new interface driver uvcvideo
[   29.251123] snd_hda_codec_realtek hdaudioC0D0: ALC889A: SKU not ready 0x400000f0
[   29.251543] snd_hda_codec_realtek hdaudioC0D0: autoconfig for ALC889A: line_outs=2 (0x14/0x16/0x0/0x0/0x0) type:speaker
[   29.251549] snd_hda_codec_realtek hdaudioC0D0:    speaker_outs=0 (0x0/0x0/0x0/0x0/0x0)
[   29.251552] snd_hda_codec_realtek hdaudioC0D0:    hp_outs=1 (0x15/0x0/0x0/0x0/0x0)
[   29.251556] snd_hda_codec_realtek hdaudioC0D0:    mono: mono_out=0x0
[   29.251558] snd_hda_codec_realtek hdaudioC0D0:    dig-out=0x1e/0x0
[   29.251560] snd_hda_codec_realtek hdaudioC0D0:    inputs:
[   29.251562] snd_hda_codec_realtek hdaudioC0D0:      Mic=0x18
[   29.251565] snd_hda_codec_realtek hdaudioC0D0:      Line=0x1a
[   29.251567] snd_hda_codec_realtek hdaudioC0D0:    dig-in=0x1f
[   29.272880] input: HDA Intel Line as /devices/pci0000:00/0000:00:1b.0/sound/card0/input10
[   29.273381] input: HDA Intel Headphone as /devices/pci0000:00/0000:00:1b.0/sound/card0/input11
[   30.124692] fbcon: Taking over console
[   30.124965] Console: switching to colour frame buffer device 210x65
[   30.223531] usbcore: registered new interface driver btusb
[   30.587536] cfg80211: Loading compiled-in X.509 certificates for regulatory database
[   30.590064] cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
[   31.270822] intel_powerclamp: No package C-state available
[   31.305682] intel_powerclamp: No package C-state available
[   33.749415] cryptd: max_cpu_qlen set to 1000
[   37.198155] b43-phy0: Broadcom 4321 WLAN found (core revision 12)
[   37.240601] b43-phy0: Found PHY: Analog 5, Type 4 (N), Revision 2
[   37.240646] b43-phy0: Found Radio: Manuf 0x17F, ID 0x2055, Revision 4, Version 0
[   37.256780] b43 ssb0:0: Direct firmware load for b43/ucode11.fw failed with error -2
[   37.256816] b43 ssb0:0: Direct firmware load for b43/ucode11.fw failed with error -2
[   37.257155] Broadcom 43xx driver loaded [ Features: PNL ]
[   37.307702] b43 ssb0:0: Direct firmware load for b43-open/ucode11.fw failed with error -2
[   37.307896] b43 ssb0:0: Direct firmware load for b43-open/ucode11.fw failed with error -2
[   37.307906] b43-phy0 ERROR: Firmware file "b43/ucode11.fw" not found
[   37.308031] b43-phy0 ERROR: Firmware file "b43-open/ucode11.fw" not found
[   37.308112] b43-phy0 ERROR: You must go to https://wireless.wiki.kernel.org/en/users/Drivers/b43#devicefirmware and download the correct firmware for this driver version. Please carefully read all instructions on this website.
[   38.927119] Adding 4193784k swap on /dev/mapper/XXXXXXXXXX  Priority:-2 extents:1 across:4193784k FS
[   52.282401] pci 0000:00:1e.0: PCI bridge to [bus 06]
[   52.282425] pci 0000:00:1e.0:   bridge window [mem 0xd0000000-0xd00fffff]
[   53.099980] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[   53.099985] Bluetooth: BNEP filters: protocol multicast
[   53.099992] Bluetooth: BNEP socket layer initialized
[   53.106610] Bluetooth: MGMT ver 1.22
[   61.822017] Dynamic Preempt: full
[   62.151415] Dynamic Preempt: full
[   62.777348] sky2 0000:05:00.0 ens5: enabling interface
[   75.931796] sky2 0000:05:00.0 ens5: Link is up at 100 Mbps, full duplex, flow control both
[   75.931848] IPv6: ADDRCONF(NETDEV_CHANGE): ens5: link becomes ready
[   92.509537] Bluetooth: RFCOMM TTY layer initialized
[   92.509552] Bluetooth: RFCOMM socket layer initialized
[   92.509560] Bluetooth: RFCOMM ver 1.11
[  129.367914] rfkill: input handler disabled
[  148.067623] rfkill: input handler enabled
[  174.659863] rfkill: input handler disabled
[  507.540719] systemd[1]: systemd 249.11-0ubuntu3.6pop0~1674074077~22.04~d0333cb running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT +GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[  507.540937] systemd[1]: Detected architecture x86-64.
[  508.454300] systemd-journald[320]: Received SIGTERM from PID 1 (systemd).
[  508.454492] systemd[1]: Stopping Journal Service...
[  508.524671] systemd[1]: resolvconf-pull-resolved.service: Deactivated successfully.
[  508.525101] systemd[1]: Finished resolvconf-pull-resolved.service.
[  508.606538] systemd[1]: systemd-journald.service: Deactivated successfully.
[  508.606973] systemd[1]: Stopped Journal Service.
[  508.607033] systemd[1]: systemd-journald.service: Consumed 1.057s CPU time.
[  508.633276] systemd[1]: Starting Journal Service...
[  508.692939] systemd[1]: Started Journal Service.
[  599.610586] BPF: 	 type_id=3 bits_offset=2208
[  599.610604] BPF:  
[  599.610611] BPF: Invalid name
[  599.610617] BPF: 
[  599.610624] failed to validate module [cpuid] BTF: -22
[  742.196582] pci 0000:00:1e.0: PCI bridge to [bus 06]
[  742.196598] pci 0000:00:1e.0:   bridge window [mem 0xd0000000-0xd00fffff]
[ 3261.586861] loop0: detected capacity change from 0 to 6127616
[ 3262.574087] BPF: [124894] FUNC a..percpu 
[ 3262.574094] BPF: type_id=124893
[ 3262.574096] BPF:  
[ 3262.574098] BPF: Invalid name
[ 3262.574100] BPF: 
[ 3262.574104] failed to validate module [isofs] BTF: -22
[ 4615.082091] BPF: [124896] STRUCT a..percpu 
[ 4615.082099] BPF: size=16 vlen=3
[ 4615.082101] BPF:  
[ 4615.082103] BPF: Invalid name
[ 4615.082105] BPF: 
[ 4615.082108] failed to validate module [zram] BTF: -22
[ 4798.520030] FAT-fs (sda1): Volume was not properly unmounted. Some data may be corrupt. Please run fsck.
[ 4804.749766] EXT4-fs (sda2): 30 orphan inodes deleted
[ 4804.749778] EXT4-fs (sda2): recovery complete
[ 4804.757932] EXT4-fs (sda2): mounted filesystem with ordered data mode. Quota mode: none.
[ 4817.709859] Adding 4194300k swap on /dev/sda3.  Priority:-3 extents:1 across:4194300k SSFS
[ 5614.583486] BPF: 	 type_id=3 bits_offset=2208
[ 5614.583501] BPF:  
[ 5614.583504] BPF: Invalid name
[ 5614.583507] BPF: 
[ 5614.583511] failed to validate module [eeprom] BTF: -22
[ 9483.916535] EXT4-fs (sda2): unmounting filesystem.
[16088.254268] BPF: 	 type_id=3 bits_offset=2208
[16088.254276] BPF:  
[16088.254278] BPF: Invalid name
[16088.254280] BPF: 
[16088.254284] failed to validate module [nfnetlink] BTF: -22
[18294.044513] usb 5-1: USB disconnect, device number 2
[18303.908438] usb 5-1: new full-speed USB device number 3 using uhci_hcd
[18304.105476] usb 5-1: New USB device found, idVendor=05ac, idProduct=0267, bcdDevice= 8.51
[18304.105489] usb 5-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[18304.105493] usb 5-1: Product: Magic Keyboard
[18304.105496] usb 5-1: Manufacturer: Apple Inc.
[18304.105499] usb 5-1: SerialNumber: ...
[18304.117553] apple 0003:05AC:0267.0006: fixing up Magic Keyboard battery report descriptor
[18304.117939] apple 0003:05AC:0267.0006: Fn key not found (Apple Wireless Keyboard clone?), disabling Fn key handling
[18304.117987] input: Apple Inc. Magic Keyboard as /devices/pci0000:00/0000:00:1d.0/usb5/5-1/5-1:1.0/0003:05AC:0267.0006/input/input12
[18304.118247] apple 0003:05AC:0267.0006: input,hiddev0,hidraw0: USB HID v1.10 Keyboard [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input0
[18304.125120] input: Apple Inc. Magic Keyboard as /devices/pci0000:00/0000:00:1d.0/usb5/5-1/5-1:1.1/0003:05AC:0267.0007/input/input13
[18304.184748] apple 0003:05AC:0267.0007: input,hiddev1,hidraw1: USB HID v1.10 Keyboard [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input1
[18304.191731] apple 0003:05AC:0267.0008: hiddev2,hidraw2: USB HID v1.10 Device [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input2
[18660.615071] BPF: 	 type_id=3 bits_offset=2208
[18660.615082] BPF:  
[18660.615085] BPF: Invalid name
[18660.615088] BPF: 
[18660.615094] failed to validate module [binfmt_misc] BTF: -22
[18727.542723] BPF: 	 type_id=3 bits_offset=2208
[18727.542731] BPF:  
[18727.542733] BPF: Invalid name
[18727.542735] BPF: 
[18727.542737] failed to validate module [eeprom] BTF: -22
[18773.676488] usb 5-1: USB disconnect, device number 3
[18796.952433] usb 5-1: new full-speed USB device number 4 using uhci_hcd
[18797.149480] usb 5-1: New USB device found, idVendor=05ac, idProduct=0267, bcdDevice= 8.51
[18797.149501] usb 5-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[18797.149510] usb 5-1: Product: Magic Keyboard
[18797.149516] usb 5-1: Manufacturer: Apple Inc.
[18797.149522] usb 5-1: SerialNumber: ...
[18797.165618] apple 0003:05AC:0267.0009: fixing up Magic Keyboard battery report descriptor
[18797.166641] apple 0003:05AC:0267.0009: Fn key not found (Apple Wireless Keyboard clone?), disabling Fn key handling
[18797.168053] input: Apple Inc. Magic Keyboard as /devices/pci0000:00/0000:00:1d.0/usb5/5-1/5-1:1.0/0003:05AC:0267.0009/input/input14
[18797.168943] apple 0003:05AC:0267.0009: input,hiddev0,hidraw0: USB HID v1.10 Keyboard [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input0
[18797.176634] input: Apple Inc. Magic Keyboard as /devices/pci0000:00/0000:00:1d.0/usb5/5-1/5-1:1.1/0003:05AC:0267.000A/input/input15
[18797.237649] apple 0003:05AC:0267.000A: input,hiddev1,hidraw1: USB HID v1.10 Keyboard [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input1
[18797.249196] apple 0003:05AC:0267.000B: hiddev2,hidraw2: USB HID v1.10 Device [Apple Inc. Magic Keyboard] on usb-0000:00:1d.0-1/input2
[18829.524701] BPF: 	 type_id=3 bits_offset=2208
[18829.524711] BPF:  
[18829.524715] BPF: Invalid name
[18829.524718] BPF: 
[18829.524721] failed to validate module [eeprom] BTF: -22
[18842.352085] BPF: 	 type_id=3 bits_offset=2208
[18842.352094] BPF:  
[18842.352096] BPF: Invalid name
[18842.352098] BPF: 
[18842.352100] failed to validate module [eeprom_93xx46] BTF: -22
[18850.926001] BPF: [124893] STRUCT a..percpu 
[18850.926011] BPF: size=40 vlen=9
[18850.926014] BPF:  
[18850.926017] BPF: Invalid name
[18850.926020] BPF: 
[18850.926024] failed to validate module [eeprom_93cx6] BTF: -22
[19449.003197] loop0: detected capacity change from 0 to 6127616
[19449.965857] BPF: [124894] FUNC a..percpu 
[19449.965875] BPF: type_id=124893
[19449.965881] BPF:  
[19449.965888] BPF: Invalid name
[19449.965893] BPF: 
[19449.965903] failed to validate module [isofs] BTF: -22
[26696.396352] BPF: [124895] FUNC a..percpu 
[26696.396361] BPF: type_id=124894
[26696.396363] BPF:  
[26696.396365] BPF: Invalid name
[26696.396367] BPF: 
[26696.396373] failed to validate module [xfs] BTF: -22
[26696.466915] BPF: 	 type_id=46010 bits_offset=0
[26696.466923] BPF:  
[26696.466925] BPF: Invalid name
[26696.466927] BPF: 
[26696.466930] failed to validate module [jfs] BTF: -22
[26696.554200] BPF: 	 type_id=3 bits_offset=2208
[26696.554211] BPF:  
[26696.554214] BPF: Invalid name
[26696.554217] BPF: 
[26696.554221] failed to validate module [msdos] BTF: -22
[26696.652045] BPF: [124893] TYPEDEF a..percpu 
[26696.652053] BPF: type_id=6684
[26696.652055] BPF:  
[26696.652057] BPF: Invalid name
[26696.652059] BPF: 
[26696.652062] failed to validate module [ntfs] BTF: -22
[26696.767113] BPF: [124896] STRUCT  
[26696.767122] BPF: size=72 vlen=17
[26696.767124] BPF:  
[26696.767126] BPF: Invalid name
[26696.767128] BPF: 
[26696.767132] failed to validate module [minix] BTF: -22
[26696.841332] BPF: 	 type_id=3 bits_offset=2208
[26696.841340] BPF:  
[26696.841342] BPF: Invalid name
[26696.841343] BPF: 
[26696.841347] failed to validate module [hfs] BTF: -22
[26696.942993] BPF: 	 type_id=3 bits_offset=2208
[26696.943002] BPF:  
[26696.943005] BPF: Invalid name
[26696.943008] BPF: 
[26696.943012] failed to validate module [hfsplus] BTF: -22
[26696.992177] BPF: 	 type_id=3 bits_offset=2208
[26696.992186] BPF:  
[26696.992188] BPF: Invalid name
[26696.992191] BPF: 
[26696.992195] failed to validate module [qnx4] BTF: -22
[26697.060145] BPF: 	 type_id=3 bits_offset=2208
[26697.060153] BPF:  
[26697.060155] BPF: Invalid name
[26697.060157] BPF: 
[26697.060161] failed to validate module [ufs] BTF: -22
[26697.100354] BPF: [124893] TYPEDEF a..percpu 
[26697.100362] BPF: type_id=124894
[26697.100364] BPF:  
[26697.100366] BPF: Invalid name
[26697.100368] BPF: 
[26697.100371] failed to validate module [zstd_compress] BTF: -22
[27034.946749] get_packages[112888]: segfault at 6b74 ip 00007efd0a45ad26 sp 00007efce7ffe150 error 4 in libglib-2.0.so.0.7200.4[7efd0a402000+8f000]
[27034.946768] Code: 48 8b 0b 44 8d 78 ff 48 89 c5 4d 89 fe 49 c1 e6 04 4c 01 f1 4c 8b 21 4d 85 e4 0f 84 e4 00 00 00 49 8b 44 24 08 48 85 c0 74 4a <48> 8b 10 49 89 54 24 08 49 89 c4 48 8b 41 08 48 85 c0 75 26 66 0f
[35108.080110] BPF: 	 type_id=3 bits_offset=2208
[35108.080128] BPF:  
[35108.080134] BPF: Invalid name
[35108.080140] BPF: 
[35108.080147] failed to validate module [pcspkr] BTF: -22
[35108.821685] input: BRLTTY 6.4 Linux Screen Driver Keyboard as /devices/virtual/input/input16
[35856.777478] usbcore: deregistering device driver apple-mfi-fastcharge
[36471.899572] BPF: [124896] ENUM a..percpu 
[36471.899580] BPF: size=4 vlen=35
[36471.899582] BPF:  
[36471.899584] BPF: Invalid name
[36471.899586] BPF: 
[36471.899590] failed to validate module [industrialio] BTF: -22
[36491.929082] BPF: [124893] FUNC a..percpu 
[36491.929090] BPF: type_id=22
[36491.929092] BPF:  
[36491.929095] BPF: Invalid name
[36491.929097] BPF: 
[36491.929100] failed to validate module [industrialio_configfs] BTF: -22
[36503.376086] BPF: [124896] ENUM a..percpu 
[36503.376098] BPF: size=4 vlen=35
[36503.376101] BPF:  
[36503.376104] BPF: Invalid name
[36503.376107] BPF: 
[36503.376112] failed to validate module [industrialio] BTF: -22
[36507.861977] BPF: [124896] ENUM a..percpu 
[36507.861986] BPF: size=4 vlen=35
[36507.861988] BPF:  
[36507.861990] BPF: Invalid name
[36507.861993] BPF: 
[36507.861997] failed to validate module [industrialio] BTF: -22
[36515.339943] BPF: [124893] FUNC a..percpu 
[36515.339954] BPF: type_id=22
[36515.339957] BPF:  
[36515.339960] BPF: Invalid name
[36515.339963] BPF: 
[36515.339967] failed to validate module [industrialio_configfs] BTF: -22
[36519.614734] BPF: [124893] FUNC a..percpu 
[36519.614745] BPF: type_id=22
[36519.614749] BPF:  
[36519.614752] BPF: Invalid name
[36519.614755] BPF: 
[36519.614758] failed to validate module [industrialio_configfs] BTF: -22
[36523.075268] BPF: [124896] ENUM a..percpu 
[36523.075277] BPF: size=4 vlen=35
[36523.075279] BPF:  
[36523.075282] BPF: Invalid name
[36523.075284] BPF: 
[36523.075288] failed to validate module [industrialio] BTF: -22
[36681.817549] BPF: 	 type_id=3 bits_offset=2208
[36681.817555] BPF:  
[36681.817557] BPF: Invalid name
[36681.817559] BPF: 
[36681.817563] failed to validate module [greybus] BTF: -22
[36876.698524] BPF: 	 type_id=3 bits_offset=2208
[36876.698533] BPF:  
[36876.698536] BPF: Invalid name
[36876.698538] BPF: 
[36876.698541] failed to validate module [nvram] BTF: -22
[36876.977006] BPF: 	 type_id=3 bits_offset=2208
[36876.977013] BPF:  
[36876.977015] BPF: Invalid name
[36876.977017] BPF: 
[36876.977019] failed to validate module [st] BTF: -22
