[    0.000000] microcode: microcode updated early to revision 0xf0, date = 2021-11-12
[    0.000000] Linux version 6.0.6-76060006-generic (XXX@XXX) (x86_64-linux-gnu-gcc-11 (Ubuntu 11.2.0-19ubuntu1) 11.2.0, GNU ld (GNU Binutils for Ubuntu) 2.38) #202210290932~1667401208~22.04~d2df702 SMP PREEMPT_DYNAMIC Wed N
[    0.000000] Command line: BOOT_IMAGE=/casper_pop-os_22.04_amd64_intel_debug_275/vmlinuz.efi boot=casper live-media-path=/casper_pop-os_22.04_amd64_intel_debug_275 hostname=... username=pop-os noprompt ---
[    0.000000] KERNEL supported cpus:
[    0.000000]   Intel GenuineIntel
[    0.000000]   AMD AuthenticAMD
[    0.000000]   Hygon HygonGenuine
[    0.000000]   Centaur CentaurHauls
[    0.000000]   zhaoxin   Shanghai  
[    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x008: 'MPX bounds registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x010: 'MPX CSR'
[    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
[    0.000000] x86/fpu: xstate_offset[3]:  832, xstate_sizes[3]:   64
[    0.000000] x86/fpu: xstate_offset[4]:  896, xstate_sizes[4]:   64
[    0.000000] x86/fpu: Enabled xstate features 0x1f, context size is 960 bytes, using 'compacted' format.
[    0.000000] signal: max sigframe size: 2032

[   89.453163] Bluetooth: BNEP socket layer initialized
[   89.458025] Bluetooth: MGMT ver 1.22
[   89.601726] intel_rapl_common: Found RAPL domain package
[   89.601730] intel_rapl_common: Found RAPL domain core
[   89.601732] intel_rapl_common: Found RAPL domain uncore
[   89.601733] intel_rapl_common: Found RAPL domain psys
[   89.699510] NET: Registered PF_ALG protocol family
[   90.927717] snd_hda_intel 0000:00:1f.3: DSP detected with PCI class/subclass/prog-if info 0x040380
[   90.927745] snd_hda_intel 0000:00:1f.3: enabling device (0000 -> 0002)
[   90.928040] snd_hda_intel 0000:00:1f.3: bound 0000:00:02.0 (ops i915_audio_component_bind_ops [i915])
[   91.290375] snd_hda_codec_conexant hdaudioC0D0: CX20724: BIOS auto-probing.
[   91.290995] snd_hda_codec_conexant hdaudioC0D0: vmaster hook already present before cdev!
[   91.292735] snd_hda_codec_conexant hdaudioC0D0: autoconfig for CX20724: line_outs=1 (0x16/0x0/0x0/0x0/0x0) type:line
[   91.292741] snd_hda_codec_conexant hdaudioC0D0:    speaker_outs=1 (0x17/0x0/0x0/0x0/0x0)
[   91.292744] snd_hda_codec_conexant hdaudioC0D0:    hp_outs=1 (0x1d/0x0/0x0/0x0/0x0)
[   91.292747] snd_hda_codec_conexant hdaudioC0D0:    mono: mono_out=0x0
[   91.292749] snd_hda_codec_conexant hdaudioC0D0:    inputs:
[   91.292751] snd_hda_codec_conexant hdaudioC0D0:      Mic=0x19
[   91.292754] snd_hda_codec_conexant hdaudioC0D0:      Internal Mic=0x1a
[   91.292756] snd_hda_codec_conexant hdaudioC0D0:      Line=0x18
[   91.548072] input: HDA Intel PCH Mic as /devices/pci0000:00/0000:00:1f.3/sound/card0/input18
[   91.548203] input: HDA Intel PCH Line as /devices/pci0000:00/0000:00:1f.3/sound/card0/input19
[   91.548684] input: HDA Intel PCH Dock Line Out as /devices/pci0000:00/0000:00:1f.3/sound/card0/input20
[   91.548752] input: HDA Intel PCH Headphone as /devices/pci0000:00/0000:00:1f.3/sound/card0/input21
[   91.548812] input: HDA Intel PCH HDMI/DP,pcm=3 as /devices/pci0000:00/0000:00:1f.3/sound/card0/input22
[   91.548880] input: HDA Intel PCH HDMI/DP,pcm=7 as /devices/pci0000:00/0000:00:1f.3/sound/card0/input23
[   91.548951] input: HDA Intel PCH HDMI/DP,pcm=8 as /devices/pci0000:00/0000:00:1f.3/sound/card0/input24
[   91.549011] input: HDA Intel PCH HDMI/DP,pcm=9 as /devices/pci0000:00/0000:00:1f.3/sound/card0/input25
[   91.549072] input: HDA Intel PCH HDMI/DP,pcm=10 as /devices/pci0000:00/0000:00:1f.3/sound/card0/input26
[  108.457529] Bluetooth: RFCOMM TTY layer initialized
[  108.457571] Bluetooth: RFCOMM socket layer initialized
[  108.457578] Bluetooth: RFCOMM ver 1.11
[  140.821189] rfkill: input handler disabled
[  147.772591] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[  147.772775] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[  147.772912] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[  147.773041] Can't find a SQUASHFS superblock on sda2
[  377.345276] usb 1-1: USB disconnect, device number 2
[  383.934022] usb 2-1: new SuperSpeed USB device number 2 using xhci_hcd
[  383.955474] usb 2-1: New USB device found, idVendor=090c, idProduct=1000, bcdDevice=11.00
[  383.955489] usb 2-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[  383.955495] usb 2-1: Product: Flash Drive
[  383.955500] usb 2-1: Manufacturer: Samsung
[  383.955505] usb 2-1: SerialNumber: ...
[  384.018375] usb-storage 2-1:1.0: USB Mass Storage device detected
[  384.018933] scsi host4: usb-storage 2-1:1.0
[  385.442659] scsi 4:0:0:0: Direct-Access     Samsung  Flash Drive      1100 PQ: 0 ANSI: 6
[  385.443319] sd 4:0:0:0: Attached scsi generic sg2 type 0
[  385.443841] sd 4:0:0:0: [sdc] 125313283 512-byte logical blocks: (64.2 GB/59.8 GiB)
[  385.444024] sd 4:0:0:0: [sdc] Write Protect is off
[  385.444031] sd 4:0:0:0: [sdc] Mode Sense: 43 00 00 00
[  385.444158] sd 4:0:0:0: [sdc] Write cache: enabled, read cache: enabled, doesn't support DPO or FUA
[  385.445798]  sdc: sdc1
[  385.446065] sd 4:0:0:0: [sdc] Attached SCSI removable disk
[  385.708508] EXT4-fs (sdc1): mounting ext2 file system using the ext4 subsystem
[  385.711420] EXT4-fs (sdc1): warning: mounting unchecked fs, running e2fsck is recommended
[  385.725278] EXT4-fs (sdc1): mounted filesystem without journal. Quota mode: none.
[  637.979173] EXT4-fs (sdc1): unmounting filesystem.
[  638.065928] sdc: detected capacity change from 125313283 to 0
[  686.593951] usb 2-1: USB disconnect, device number 2
[  693.765613] usb 1-1: new low-speed USB device number 6 using xhci_hcd
[  693.917054] usb 1-1: New USB device found, idVendor=093a, idProduct=2510, bcdDevice= 1.00
[  693.917078] usb 1-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[  693.917090] usb 1-1: Product: USB Optical Mouse
[  693.917099] usb 1-1: Manufacturer: PixArt
[  693.925791] input: PixArt USB Optical Mouse as /devices/pci0000:00/0000:00:14.0/usb1/1-1/1-1:1.0/0003:093A:2510.0002/input/input27
[  693.926375] hid-generic 0003:093A:2510.0002: input,hidraw0: USB HID v1.11 Mouse [PixArt USB Optical Mouse] on usb-0000:00:14.0-1/input0
[  866.843297] wlp2s0: authenticate with XX:XX:XX:XX:XX:XX
[  866.857572] wlp2s0: bad VHT capabilities, disabling VHT
[  866.867207] wlp2s0: send auth to XX:XX:XX:XX:XX:XX (try 1/3)
[  866.872584] wlp2s0: authenticated
[  866.872768] wlp2s0: VHT capa missing/short, disabling VHT/HE/EHT
[  866.897585] wlp2s0: associate with XX:XX:XX:XX:XX:XX (try 1/3)
[  866.905064] wlp2s0: RX AssocResp from XX:XX:XX:XX:XX:XX (capab=0x11 status=0 aid=1)
[  866.908032] wlp2s0: associated
[  867.034073] IPv6: ADDRCONF(NETDEV_CHANGE): wlp2s0: link becomes ready
[ 1675.600340] rfkill: input handler enabled
[ 1681.732415] rfkill: input handler disabled
[ 1685.559949] rfkill: input handler enabled
[ 1690.596377] rfkill: input handler disabled
[ 1696.366805] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 1696.367003] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 1696.367137] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 1696.367259] Can't find a SQUASHFS superblock on sda2
[ 2170.826176] BPF: 	 type_id=1651 bits_offset=1408
[ 2170.826182] BPF:  
[ 2170.826183] BPF: Invalid name
[ 2170.826184] BPF: 
[ 2170.826186] failed to validate module [cpuid] BTF: -22
[ 4750.177769] usb 1-1: USB disconnect, device number 6
[ 4783.710179] usb 2-1: new SuperSpeed USB device number 3 using xhci_hcd
[ 4783.731349] usb 2-1: New USB device found, idVendor=090c, idProduct=1000, bcdDevice=11.00
[ 4783.731366] usb 2-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 4783.731373] usb 2-1: Product: Flash Drive
[ 4783.731379] usb 2-1: Manufacturer: Samsung
[ 4783.731384] usb 2-1: SerialNumber: ...
[ 4783.795649] usb-storage 2-1:1.0: USB Mass Storage device detected
[ 4783.796566] scsi host4: usb-storage 2-1:1.0
[ 4785.224506] scsi 4:0:0:0: Direct-Access     Samsung  Flash Drive      1100 PQ: 0 ANSI: 6
[ 4785.225223] sd 4:0:0:0: Attached scsi generic sg2 type 0
[ 4785.225402] sd 4:0:0:0: [sdc] 125313283 512-byte logical blocks: (64.2 GB/59.8 GiB)
[ 4785.225599] sd 4:0:0:0: [sdc] Write Protect is off
[ 4785.225607] sd 4:0:0:0: [sdc] Mode Sense: 43 00 00 00
[ 4785.227109] sd 4:0:0:0: [sdc] Write cache: enabled, read cache: enabled, doesn't support DPO or FUA
[ 4785.233927]  sdc: sdc1
[ 4785.234115] sd 4:0:0:0: [sdc] Attached SCSI removable disk
[ 4786.663229] EXT4-fs (sdc1): mounting ext2 file system using the ext4 subsystem
[ 4786.666507] EXT4-fs (sdc1): warning: mounting unchecked fs, running e2fsck is recommended
[ 4786.681315] EXT4-fs (sdc1): mounted filesystem without journal. Quota mode: none.
[ 5502.103986] EXT4-fs (sdc1): unmounting filesystem.
[ 5502.277417] sdc: detected capacity change from 125313283 to 0
[ 5505.561794] usb 2-1: USB disconnect, device number 3
[ 5505.821730] usb 1-1: new high-speed USB device number 7 using xhci_hcd
[ 5505.971714] usb 1-1: New USB device found, idVendor=090c, idProduct=1000, bcdDevice=11.00
[ 5505.971732] usb 1-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 5505.971741] usb 1-1: Product: Flash Drive
[ 5505.971747] usb 1-1: Manufacturer: Samsung
[ 5505.971753] usb 1-1: SerialNumber: ...
[ 5505.977217] usb-storage 1-1:1.0: USB Mass Storage device detected
[ 5505.977865] scsi host4: usb-storage 1-1:1.0
[ 5506.503914] usb 1-1: USB disconnect, device number 7
[ 5512.097822] usb 1-1: new low-speed USB device number 8 using xhci_hcd
[ 5512.249925] usb 1-1: New USB device found, idVendor=093a, idProduct=2510, bcdDevice= 1.00
[ 5512.249941] usb 1-1: New USB device strings: Mfr=1, Product=2, SerialNumber=...
[ 5512.249948] usb 1-1: Product: USB Optical Mouse
[ 5512.249954] usb 1-1: Manufacturer: PixArt
[ 5512.256251] input: PixArt USB Optical Mouse as /devices/pci0000:00/0000:00:14.0/usb1/1-1/1-1:1.0/0003:093A:2510.0003/input/input28
[ 5512.256947] hid-generic 0003:093A:2510.0003: input,hidraw0: USB HID v1.11 Mouse [PixArt USB Optical Mouse] on usb-0000:00:14.0-1/input0
[ 6410.942127] rfkill: input handler enabled
[ 6434.570856] rfkill: input handler disabled
[ 6441.081537] rfkill: input handler enabled
[ 6447.784878] rfkill: input handler disabled
[ 6453.403241] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 6453.403438] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 6453.403572] EXT4-fs (sda2): VFS: Can't find ext4 filesystem
[ 6453.403699] Can't find a SQUASHFS superblock on sda2
[ 7734.868240] BPF: 	 type_id=1651 bits_offset=1408
[ 7734.868247] BPF:  
[ 7734.868248] BPF: Invalid name
[ 7734.868250] BPF: 
[ 7734.868251] failed to validate module [nvram] BTF: -22
[ 7735.395738] BPF: 	 type_id=1651 bits_offset=1408
[ 7735.395743] BPF:  
[ 7735.395745] BPF: Invalid name
[ 7735.395746] BPF: 
[ 7735.395748] failed to validate module [st] BTF: -22
[ 7751.865204] BPF: 	 type_id=1651 bits_offset=1408
[ 7751.865209] BPF:  
[ 7751.865211] BPF: Invalid name
[ 7751.865212] BPF: 
[ 7751.865214] failed to validate module [tls] BTF: -22
[ 7935.622068] BPF: 	 type_id=1651 bits_offset=1408
[ 7935.622073] BPF:  
[ 7935.622074] BPF: Invalid name
[ 7935.622076] BPF: 
[ 7935.622077] failed to validate module [nvram] BTF: -22
[ 7936.167188] BPF: 	 type_id=1651 bits_offset=1408
[ 7936.167193] BPF:  
[ 7936.167194] BPF: Invalid name
[ 7936.167196] BPF: 
[ 7936.167198] failed to validate module [st] BTF: -22
[ 7942.695427] BPF: 	 type_id=1651 bits_offset=1408
[ 7942.695433] BPF:  
[ 7942.695434] BPF: Invalid name
[ 7942.695435] BPF: 
[ 7942.695438] failed to validate module [tls] BTF: -22
[ 8419.547213] BPF: 	 type_id=1651 bits_offset=1408
[ 8419.547217] BPF:  
[ 8419.547219] BPF: Invalid name
[ 8419.547220] BPF: 
[ 8419.547222] failed to validate module [nvram] BTF: -22
[ 8420.097392] BPF: 	 type_id=1651 bits_offset=1408
[ 8420.097397] BPF:  
[ 8420.097399] BPF: Invalid name
[ 8420.097400] BPF: 
[ 8420.097402] failed to validate module [st] BTF: -22
