[    0.000000] Linux version 6.0.0-2-amd64 (XXX@XXX) (gcc-12 (Debian 12.2.0-7) 12.2.0, GNU ld (GNU Binutils for Debian) 2.39) #1 SMP PREEMPT_DYNAMIC Debian 6.0.3-1 (2022-10-21)
[    0.000000] Command line: BOOT_IMAGE=/boot/vmlinuz-6.0.0-2-amd64 root=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX ro quiet
[    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
[    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
[    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
[    0.000000] x86/fpu: Enabled xstate features 0x7, context size is 832 bytes, using 'standard' format.
[    0.000000] signal: max sigframe size: 1776
[    0.000000] BIOS-provided physical RAM map:
[    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000008ffff] usable
[    0.000000] BIOS-e820: [mem 0x0000000000090000-0x00000000000bffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000000100000-0x000000001fffffff] usable
[    0.000000] BIOS-e820: [mem 0x0000000020000000-0x00000000201fffff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000020200000-0x0000000040003fff] usable
[    0.000000] BIOS-e820: [mem 0x0000000040004000-0x0000000040004fff] reserved
[    0.000000] BIOS-e820: [mem 0x0000000040005000-0x00000000cf44ffff] usable
[    0.000000] BIOS-e820: [mem 0x00000000cf450000-0x00000000cf651fff] reserved

[    5.272322] iwlwifi 0000:03:00.0: CONFIG_IWLWIFI_DEBUG disabled
[    5.272328] iwlwifi 0000:03:00.0: CONFIG_IWLWIFI_DEBUGFS disabled
[    5.272330] iwlwifi 0000:03:00.0: CONFIG_IWLWIFI_DEVICE_TRACING disabled
[    5.272331] iwlwifi 0000:03:00.0: Detected Intel(R) Centrino(R) Advanced-N 6205 AGN, REV=0xB0
[    5.277081] snd_hda_intel 0000:00:1b.0: bound 0000:00:02.0 (ops i915_audio_component_bind_ops [i915])
[    5.311815] ieee80211 phy0: Selected rate control algorithm 'iwl-agn-rs'
[    5.313421] iwlwifi 0000:03:00.0 wlp3s0: renamed from wlan0
[    5.347786] snd_hda_codec_realtek hdaudioC0D0: autoconfig for ALC3202: line_outs=1 (0x14/0x0/0x0/0x0/0x0) type:speaker
[    5.347794] snd_hda_codec_realtek hdaudioC0D0:    speaker_outs=0 (0x0/0x0/0x0/0x0/0x0)
[    5.347797] snd_hda_codec_realtek hdaudioC0D0:    hp_outs=2 (0x15/0x1b/0x0/0x0/0x0)
[    5.347800] snd_hda_codec_realtek hdaudioC0D0:    mono: mono_out=0x0
[    5.347802] snd_hda_codec_realtek hdaudioC0D0:    inputs:
[    5.347804] snd_hda_codec_realtek hdaudioC0D0:      Mic=0x18
[    5.347806] snd_hda_codec_realtek hdaudioC0D0:      Dock Mic=0x19
[    5.347808] snd_hda_codec_realtek hdaudioC0D0:      Internal Mic=0x12
[    5.366081] input: HDA Digital PCBeep as /devices/pci0000:00/0000:00:1b.0/sound/card0/input10
[    5.366129] input: HDA Intel PCH Mic as /devices/pci0000:00/0000:00:1b.0/sound/card0/input11
[    5.366164] input: HDA Intel PCH Dock Mic as /devices/pci0000:00/0000:00:1b.0/sound/card0/input12
[    5.366196] input: HDA Intel PCH Headphone as /devices/pci0000:00/0000:00:1b.0/sound/card0/input13
[    5.366226] input: HDA Intel PCH Dock Headphone as /devices/pci0000:00/0000:00:1b.0/sound/card0/input14
[    5.366258] input: HDA Intel PCH HDMI/DP,pcm=3 as /devices/pci0000:00/0000:00:1b.0/sound/card0/input15
[    5.366289] input: HDA Intel PCH HDMI/DP,pcm=7 as /devices/pci0000:00/0000:00:1b.0/sound/card0/input16
[    5.366319] input: HDA Intel PCH HDMI/DP,pcm=8 as /devices/pci0000:00/0000:00:1b.0/sound/card0/input17
[    5.542048] intel_rapl_common: Found RAPL domain package
[    5.542052] intel_rapl_common: Found RAPL domain core
[    5.542053] intel_rapl_common: Found RAPL domain uncore
[    5.542057] intel_rapl_common: RAPL package-0 domain package locked by BIOS
[    6.347967] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[    6.563493] alg: No test for fips(ansi_cprng) (fips_ansi_cprng)
[    6.656960] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[    6.677985] Bluetooth: Core ver 2.22
[    6.678011] NET: Registered PF_BLUETOOTH protocol family
[    6.678012] Bluetooth: HCI device and connection manager initialized
[    6.678016] Bluetooth: HCI socket layer initialized
[    6.678017] Bluetooth: L2CAP socket layer initialized
[    6.678021] Bluetooth: SCO socket layer initialized
[    6.693290] usbcore: registered new interface driver btusb
[    6.791790] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[    6.791794] Bluetooth: BNEP filters: protocol multicast
[    6.791798] Bluetooth: BNEP socket layer initialized
[    6.797205] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[    6.809773] Bluetooth: hci0: BCM: chip id 63
[    6.810831] Bluetooth: hci0: BCM: features 0x07
[    6.826789] Bluetooth: hci0: ...
[    6.826793] Bluetooth: hci0: BCM20702A1 (001.002.014) build 0000
[    6.828130] bluetooth hci0: firmware: failed to load brcm/BCM20702A1-0a5c-21e6.hcd (-2)
[    6.828136] firmware_class: See https://wiki.debian.org/Firmware for information about missing firmware
[    6.828147] bluetooth hci0: firmware: failed to load brcm/BCM20702A1-0a5c-21e6.hcd (-2)
[    6.828160] bluetooth hci0: firmware: failed to load brcm/BCM-0a5c-21e6.hcd (-2)
[    6.828169] bluetooth hci0: firmware: failed to load brcm/BCM-0a5c-21e6.hcd (-2)
[    6.828171] Bluetooth: hci0: BCM: firmware Patch file not found, tried:
[    6.828173] Bluetooth: hci0: BCM: 'brcm/BCM20702A1-0a5c-21e6.hcd'
[    6.828174] Bluetooth: hci0: BCM: 'brcm/BCM-0a5c-21e6.hcd'
[    6.883056] Bluetooth: MGMT ver 1.22
[    6.888823] NET: Registered PF_ALG protocol family
[    7.098081] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[   10.264679] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[   10.578067] iwlwifi 0000:03:00.0: Radio type=0x1-0x2-0x0
[   10.729673] wlp3s0: authenticate with XXX
[   10.743789] wlp3s0: bad VHT capabilities, disabling VHT
[   10.774794] wlp3s0: send auth to XXX (try 1/3)
[   10.779731] wlp3s0: authenticated
[   10.803750] wlp3s0: waiting for beacon from XXX
[   10.823764] wlp3s0: associate with XXX (try 1/3)
[   10.827911] wlp3s0: RX AssocResp from XXX (capab=0x431 status=0 aid=6)
[   10.855319] wlp3s0: associated
[   11.932301] IPv6: ADDRCONF(NETDEV_CHANGE): wlp3s0: link becomes ready
[   36.133107] systemd-journald[311]: Time jumped backwards, rotating.
[  189.308424] systemd[1]: systemd 252~rc3-2 running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT -GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +TPM2 +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -BPF_FRAMEWORK -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[  189.308560] systemd[1]: Detected architecture x86-64.
[  194.534406] systemd[1]: systemd 252-2 running in system mode (+PAM +AUDIT +SELINUX +APPARMOR +IMA +SMACK +SECCOMP +GCRYPT -GNUTLS +OPENSSL +ACL +BLKID +CURL +ELFUTILS +FIDO2 +IDN2 -IDN +IPTC +KMOD +LIBCRYPTSETUP +LIBFDISK +PCRE2 -PWQUALITY -P11KIT -QRENCODE +TPM2 +BZIP2 +LZ4 +XZ +ZLIB +ZSTD -BPF_FRAMEWORK -XKBCOMMON +UTMP +SYSVINIT default-hierarchy=unified)
[  194.534557] systemd[1]: Detected architecture x86-64.
[  194.740054] systemd-journald[311]: Received SIGTERM from PID 1 (systemd).
[  194.740152] systemd[1]: Stopping Journal Service...
[  194.751844] systemd[1]: systemd-journald.service: Deactivated successfully.
[  194.751996] systemd[1]: Stopped Journal Service.
[  194.795161] systemd[1]: Starting Journal Service...
[  194.821110] systemd[1]: Started Journal Service.
[  287.771507] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  287.771512] BPF:  
[  287.771514] BPF: Invalid name
[  287.771514] BPF: 
[  287.771516] failed to validate module [dm_mod] BTF: -22
[  287.990154] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  287.990159] BPF:  
[  287.990160] BPF: Invalid name
[  287.990161] BPF: 
[  287.990162] failed to validate module [dm_mod] BTF: -22
[  288.119089] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.119103] BPF:  
[  288.119104] BPF: Invalid name
[  288.119106] BPF: 
[  288.119108] failed to validate module [dm_mod] BTF: -22
[  288.241938] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.241943] BPF:  
[  288.241944] BPF: Invalid name
[  288.241945] BPF: 
[  288.241947] failed to validate module [dm_mod] BTF: -22
[  288.398803] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.398808] BPF:  
[  288.398809] BPF: Invalid name
[  288.398810] BPF: 
[  288.398820] failed to validate module [dm_mod] BTF: -22
[  288.528701] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.528706] BPF:  
[  288.528707] BPF: Invalid name
[  288.528708] BPF: 
[  288.528710] failed to validate module [dm_mod] BTF: -22
[  288.633118] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.633123] BPF:  
[  288.633124] BPF: Invalid name
[  288.633125] BPF: 
[  288.633127] failed to validate module [dm_mod] BTF: -22
[  288.778165] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.778180] BPF:  
[  288.778182] BPF: Invalid name
[  288.778184] BPF: 
[  288.778187] failed to validate module [dm_mod] BTF: -22
[  288.906627] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  288.906632] BPF:  
[  288.906634] BPF: Invalid name
[  288.906635] BPF: 
[  288.906637] failed to validate module [dm_mod] BTF: -22
[  289.043927] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.043932] BPF:  
[  289.043933] BPF: Invalid name
[  289.043934] BPF: 
[  289.043936] failed to validate module [dm_mod] BTF: -22
[  289.166947] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.166951] BPF:  
[  289.166953] BPF: Invalid name
[  289.166954] BPF: 
[  289.166955] failed to validate module [dm_mod] BTF: -22
[  289.298579] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.298584] BPF:  
[  289.298585] BPF: Invalid name
[  289.298586] BPF: 
[  289.298588] failed to validate module [dm_mod] BTF: -22
[  289.436175] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.436179] BPF:  
[  289.436181] BPF: Invalid name
[  289.436181] BPF: 
[  289.436183] failed to validate module [dm_mod] BTF: -22
[  289.590353] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.590359] BPF:  
[  289.590360] BPF: Invalid name
[  289.590361] BPF: 
[  289.590363] failed to validate module [dm_mod] BTF: -22
[  289.716312] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.716317] BPF:  
[  289.716318] BPF: Invalid name
[  289.716319] BPF: 
[  289.716320] failed to validate module [dm_mod] BTF: -22
[  289.849983] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.849987] BPF:  
[  289.849988] BPF: Invalid name
[  289.849989] BPF: 
[  289.850000] failed to validate module [dm_mod] BTF: -22
[  289.974323] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  289.974328] BPF:  
[  289.974329] BPF: Invalid name
[  289.974330] BPF: 
[  289.974331] failed to validate module [dm_mod] BTF: -22
[  290.121626] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.121631] BPF:  
[  290.121633] BPF: Invalid name
[  290.121634] BPF: 
[  290.121637] failed to validate module [dm_mod] BTF: -22
[  290.254487] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.254493] BPF:  
[  290.254503] BPF: Invalid name
[  290.254504] BPF: 
[  290.254506] failed to validate module [dm_mod] BTF: -22
[  290.388364] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.388370] BPF:  
[  290.388371] BPF: Invalid name
[  290.388372] BPF: 
[  290.388373] failed to validate module [dm_mod] BTF: -22
[  290.533105] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.533110] BPF:  
[  290.533111] BPF: Invalid name
[  290.533112] BPF: 
[  290.533113] failed to validate module [dm_mod] BTF: -22
[  290.674339] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.674345] BPF:  
[  290.674347] BPF: Invalid name
[  290.674347] BPF: 
[  290.674349] failed to validate module [dm_mod] BTF: -22
[  290.826778] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.826784] BPF:  
[  290.826785] BPF: Invalid name
[  290.826787] BPF: 
[  290.826789] failed to validate module [dm_mod] BTF: -22
[  290.953669] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  290.953684] BPF:  
[  290.953685] BPF: Invalid name
[  290.953686] BPF: 
[  290.953688] failed to validate module [dm_mod] BTF: -22
[  291.090881] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  291.090886] BPF:  
[  291.090887] BPF: Invalid name
[  291.090888] BPF: 
[  291.090890] failed to validate module [dm_mod] BTF: -22
[  291.207891] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  291.207898] BPF:  
[  291.207899] BPF: Invalid name
[  291.207901] BPF: 
[  291.207903] failed to validate module [dm_mod] BTF: -22
[  291.333021] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  291.333039] BPF:  
[  291.333041] BPF: Invalid name
[  291.333042] BPF: 
[  291.333044] failed to validate module [dm_mod] BTF: -22
[  291.473652] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  291.473658] BPF:  
[  291.473659] BPF: Invalid name
[  291.473660] BPF: 
[  291.473662] failed to validate module [dm_mod] BTF: -22
[  291.738015] BPF: 	 type_id=59 bitfield_size=0 bits_offset=288
[  291.738020] BPF:  
[  291.738021] BPF: Invalid name
[  291.738022] BPF: 
[  291.738023] failed to validate module [dm_mod] BTF: -22
[  939.154620] BPF: 	.percpu type_id=40498 bits_offset=320
[  939.154625] BPF:  
[  939.154627] BPF: Invalid name
[  939.154627] BPF: 
[  939.154629] failed to validate module [st] BTF: -22
[  939.490978] BPF: 	 type_id=59 bits_offset=0
[  939.490985] BPF:  
[  939.490987] BPF: Invalid name
[  939.490988] BPF: 
[  939.490990] failed to validate module [edd] BTF: -22
[  943.688333] BPF: [97156] FUNC data..percpu 
[  943.688339] BPF: type_id=97150
[  943.688340] BPF:  
[  943.688341] BPF: Invalid name
[  943.688342] BPF: 
[  943.688343] failed to validate module [msr] BTF: -22
[  943.745751] BPF: [97156] FUNC data..percpu 
[  943.745758] BPF: type_id=97150
[  943.745760] BPF:  
[  943.745761] BPF: Invalid name
[  943.745762] BPF: 
[  943.745764] failed to validate module [msr] BTF: -22
[ 1075.141666] BPF: 	.percpu type_id=40498 bits_offset=320
[ 1075.141671] BPF:  
[ 1075.141672] BPF: Invalid name
[ 1075.141673] BPF: 
[ 1075.141684] failed to validate module [st] BTF: -22
[ 1075.514428] BPF: 	 type_id=59 bits_offset=0
[ 1075.514435] BPF:  
[ 1075.514437] BPF: Invalid name
[ 1075.514438] BPF: 
[ 1075.514440] failed to validate module [edd] BTF: -22
